izaanka/RhythmSleep_v3/esp32s3_rhythmSleep_arduinoide/esp32s3_rhythmSleep_arduinoide.ino
/*
  ===================================================================
  ESP32-S3 Integrated System with Neural Network Smart Alarm (Arduino IDE)
  ===================================================================
  Project Name: esp32s3_rhythmSleep_arduinoide.ino
  ===================================================================
*/

#include <Arduino.h>
#include <Wire.h>
#include <SPI.h>
#include <FS.h>
#include <SD.h>
#include <RTClib.h>
#include <Adafruit_GFX.h>
#include <Adafruit_SSD1306.h>
#include <Adafruit_ST7789.h>
#include <BLEDevice.h>
#include <BLEUtils.h>
#include <BLEServer.h>
#include <WiFi.h>
#include <DNSServer.h>
#include <WebServer.h>
#include <WiFiUdp.h>
#include <HTTPClient.h>
#include <Preferences.h>
#include <math.h>
#include <driver/rtc_io.h>

// --- Pin Definitions ---
#define SDA_PIN        8
#define SCL_PIN        7
#define ANALOG_EEG_PIN 9

// 4 Physical Buttons (Active LOW with internal pull-ups)
#define BTN_UP_PIN     13 // UP Button (GPIO 13)
#define BTN_SELECT_PIN 10 // CLICK / SELECT Button (GPIO 10)
#define BTN_DOWN_PIN   12 // DOWN Button (GPIO 12)
#define BTN_MENU_PIN   11 // BACK / MENU Button (GPIO 11)

// --- Haptic Vibration Motor Pin ---
#define PIN_VIBRATION  14

// --- ST7789 2.8" TFT Display Pins ---
#define TFT_MOSI       4   // Shared SPI MOSI
#define TFT_SCLK       3   // Shared SPI Clock
#define TFT_MISO       2   // Shared SPI MISO
#define TFT_CS         38  // Chip Select for ST7789 Display
#define TFT_DC         39  // Data / Command Pin
#define TFT_RST        40  // Reset Pin
#define TFT_BLK        48  // Backlight LED Control Pin

// --- SD Card Module Pins ---
#define SD_VCC_PIN     6   // Driven HIGH by code
#define SD_GND_PIN     1   // Driven LOW by code
#define SD_CS_PIN      5   // Chip Select for SD Card Module
#define SPI_MOSI_PIN   4
#define SPI_SCLK_PIN   3
#define SPI_MISO_PIN   2

// --- Audio Speaker Pins ---
#define USB_AUDIO_DP_PIN 20  // Speaker D+
#define USB_AUDIO_DN_PIN 19  // Speaker D-
#define LEDC_AUDIO_CH    0

// --- OLED Configuration ---
#define OLED_WIDTH     128
#define OLED_HEIGHT    64
#define OLED_RESET     -1
#define OLED_I2C_ADDR  0x3C

// --- TFT Colors (RGB565) ---
#define ST7789_BLACK       0x0000
#define ST7789_WHITE       0xFFFF
#define ST7789_NAVY        0x000F
#define ST7789_CYAN        0x07FF
#define ST7789_GREEN       0x07E0
#define ST7789_YELLOW      0xFFE0
#define ST7789_ORANGE      0xFD20
#define ST7789_RED         0xF800
#define ST7789_DARKGRAY    0x31E6
#define ST7789_LIGHTGRAY   0xC618
#define ST7789_BLUE        0x001F

// --- FFT & Signal Processing Constants ---
#define SAMPLES         512
#define SAMPLING_FREQ   256.0
#define MIN_FREQ        0.5
#define MAX_FREQ        100.0
#define HISTORY_LEN     10

// 15-Second Display Timeout (15,000 milliseconds)
#define DISPLAY_TIMEOUT_MS  15000

// 2-Minute Smart Alarm Rolling History Buffer (120 seconds)
#define SMART_ALARM_WINDOW_SEC 120

const unsigned long samplingPeriodUs = round(1000000.0 / SAMPLING_FREQ);

// --- Neural Network Dimensions (16 -> 32 -> 16 -> 4 MLP) ---
#define NN_INPUT_SIZE    16
#define NN_HIDDEN1_SIZE  32
#define NN_HIDDEN2_SIZE  16
#define NN_OUTPUT_SIZE   4

// Pre-trained Neural Network Weights from RhythmSleep
const float DEFAULT_NN_WEIGHTS[1140] PROGMEM = {
    -1.507168f, -0.027227f, 1.782697f, 1.422662f, 0.415028f, -0.029327f, 0.002980f, 0.022542f,
    -1.250082f, 0.816301f, -0.019879f, 0.017118f, -0.022898f, -0.054146f, -0.048826f, 0.601443f,
    -1.492208f, -0.027129f, 1.969158f, 1.450154f, 0.398018f, -0.036330f, -0.019555f, 0.001422f,
    -1.225812f, 0.788463f, 0.030189f, -0.017307f, 0.025071f, -0.033891f, 0.015894f, 0.643247f,
    -1.574149f, -0.023907f, 2.117312f, 1.593909f, 0.411134f, -0.018120f, 0.002598f, -0.004670f,
    -1.164967f, 0.807633f, 0.010128f, -0.012356f, -0.014628f, -0.012977f, 0.011834f, 0.587371f,
    -1.491307f, 0.062262f, 2.276134f, 1.690219f, 0.436036f, -0.012242f, -0.061144f, -0.030243f,
    -1.256124f, 0.789455f, 0.000553f, 0.050293f, 0.009808f, -0.006573f, 0.024882f, 0.533666f,
    -1.492932f, 0.023126f, 2.355643f, 1.834313f, 0.410155f, -0.012459f, 0.018983f, 0.068121f,
    -1.194544f, 0.807447f, -0.013781f, -0.025495f, 0.024910f, -0.025683f, 0.002147f, 0.585670f,
    -1.485631f, 0.010010f, 2.581126f, 1.884699f, 0.391904f, -0.029363f, -0.013329f, 0.011319f,
    -1.177290f, 0.772335f, 0.026088f, 0.040669f, 0.012403f, 0.56304f, -0.023214f, 0.562660f,
    -1.553362f, 0.044881f, 2.719631f, 1.998333f, 0.408399f, -0.033765f, 0.073373f, 0.003877f,
    -1.196718f, 0.821773f, 0.014430f, 0.006717f, -0.023714f, 0.014144f, 0.056461f, 0.640363f,
    -1.452204f, -0.015336f, 2.820312f, 2.096226f, 0.401672f, 0.032826f, -0.050774f, 0.045887f,
    -1.204740f, 0.787194f, -0.030363f, -0.049646f, 0.024695f, 0.002200f, -0.038699f, 0.561148f,
    -0.310074f, 1.650071f, -0.807788f, -0.045094f, -0.007372f, -0.008182f, 1.119093f, 0.598371f,
    -0.006928f, 0.320886f, 0.455469f, 0.033797f, -0.008067f, -0.033196f, 0.077201f, 0.001777f,
    -0.299582f, 1.749276f, -0.794057f, -0.004331f, -0.017210f, -0.016406f, 1.199017f, 0.583697f,
    -0.008906f, 0.405524f, 0.403980f, 0.032231f, -0.018155f, 0.018599f, 0.089851f, 0.012521f,
    -0.301389f, 1.890610f, -0.835467f, 0.049755f, -0.019550f, 0.006247f, 1.189578f, 0.627798f,
    0.017326f, 0.428780f, 0.413757f, 0.055819f, -0.011680f, -0.014389f, 0.090623f, -0.008272f,
    -0.347712f, 2.062085f, -0.803730f, 0.002813f, -0.030588f, -0.021021f, 1.173821f, 0.548231f,
    -0.006093f, 0.426725f, 0.411624f, -0.017758f, -0.002130f, -0.003978f, 0.085351f, -0.004457f,
    -0.339247f, 2.215286f, -0.809160f, -0.014299f, -0.024508f, 0.023249f, 1.188358f, 0.597926f,
    -0.034509f, 0.384666f, 0.422409f, -0.022987f, -0.024599f, -0.006833f, 0.090023f, 0.000305f,
    -0.301740f, 2.366228f, -0.771960f, 0.010189f, 0.038166f, -0.015091f, 1.218512f, 0.627063f,
    -0.022204f, 0.395240f, 0.380063f, 0.021876f, 0.005116f, 0.010620f, 0.089851f, 0.005728f,
    -0.320490f, 2.474661f, -0.825838f, -0.007622f, -0.022805f, -0.018260f, 1.200388f, 0.638213f,
    0.024220f, 0.366914f, 0.403814f, -0.004060f, 0.008331f, -0.010168f, 0.089760f, 0.024479f,
    -0.309028f, 2.659972f, -0.827299f, -0.013146f, 0.040228f, -0.007663f, 1.203362f, 0.589886f,
    -0.021171f, 0.384724f, 0.427909f, -0.029806f, 0.001927f, -0.024231f, 0.063162f, 0.002396f,
    1.782057f, -0.038482f, -1.488316f, -1.218821f, 0.023242f, 1.011855f, 0.017551f, 0.012579f,
    1.393437f, -1.026402f, -0.490715f, 0.771239f, 0.008240f, -0.022849f, -0.003507f, -0.029367f,
    1.956637f, 0.003923f, -1.474775f, -1.189569f, 0.019557f, 1.018617f, -0.008138f, -0.001648f,
    1.433296f, -1.029803f, -0.496580f, 0.793392f, 0.006956f, -0.034503f, 0.002302f, 0.015798f,
    2.102636f, 0.022718f, -1.482035f, -1.185617f, -0.001402f, 0.999650f, 0.028904f, 0.002047f,
    1.378907f, -1.004457f, -0.536965f, 0.798150f, -0.040182f, -0.009411f, 0.005503f, -0.032607f,
    2.261906f, -0.004245f, -1.472714f, -1.182431f, -0.009613f, 0.978255f, -0.014264f, -0.040683f,
    1.375837f, -0.993435f, -0.499692f, 0.793540f, -0.006421f, -0.012574f, 0.013587f, -0.002061f,
    2.428236f, 0.008622f, -1.492572f, -1.229193f, -0.008985f, 0.963283f, -0.011854f, -0.021020f,
    1.432616f, -1.011843f, -0.518625f, 0.812328f, -0.023224f, 0.038480f, 0.000624f, 0.022194f,
    2.548905f, 0.020299f, -1.470511f, -1.218080f, -0.027052f, 0.971261f, 0.024976f, 0.017586f,
    1.393435f, -0.976077f, -0.513364f, 0.803875f, -0.026771f, -0.014169f, -0.037107f, -0.023363f,
    2.716167f, -0.005111f, -1.488344f, -1.206237f, 0.010214f, 0.996160f, -0.010173f, 0.005991f,
    1.399990f, -1.014674f, -0.510344f, 0.781600f, 0.021796f, -0.002164f, 0.008882f, -0.004186f,
    2.836261f, -0.017316f, -1.490899f, -1.189745f, 0.002364f, 1.013583f, -0.009772f, -0.036669f,
    1.411130f, -1.009590f, -0.523091f, 0.802163f, 0.009653f, -0.008542f, 0.003923f, -0.009943f,
    -1.405527f, 0.395726f, -0.793738f, 1.621379f, 0.773347f, -0.000632f, -0.323602f, 0.033333f,
    -0.031580f, 1.500589f, -0.771743f, 0.767137f, 0.505085f, -0.704207f, -0.722883f, 0.023028f,
    -1.418705f, 0.380721f, -0.803730f, 1.616335f, 0.798150f, -0.000609f, -0.288289f, -0.016339f,
    -0.029411f, 1.505417f, -0.805562f, 0.788544f, 0.501509f, -0.672008f, -0.669866f, -0.011666f,
    -1.424364f, 0.404555f, -0.812361f, 1.603378f, 0.767702f, 0.029815f, -0.282531f, -0.002824f,
    -0.006856f, 1.488056f, -0.808018f, 0.783637f, 0.507421f, -0.730248f, -0.730302f, -0.043516f,
    -1.393433f, 0.403756f, -0.818817f, 1.597401f, 0.814321f, -0.012580f, -0.334135f, 0.029706f,
    0.013444f, 1.470659f, -0.777977f, 0.781682f, 0.468205f, -0.709322f, -0.675034f, -0.021028f,
    -1.378036f, 0.419409f, -0.817344f, 1.594770f, 0.770954f, 0.012474f, -0.301280f, 0.007693f,
    -0.022941f, 1.502931f, -0.825227f, 0.772592f, 0.485121f, -0.701185f, -0.692484f, 0.000305f,
    -1.421679f, 0.428387f, -0.793739f, 1.608316f, 0.769931f, -0.000355f, -0.264421f, 0.015093f,
    -0.028775f, 1.528359f, -0.779707f, 0.785081f, 0.490890f, -0.686866f, -0.713597f, 0.002271f,
    -1.385750f, 0.401918f, -0.793708f, 1.591244f, 0.818817f, -0.038481f, -0.279883f, 0.012351f,
    0.004128f, 1.505705f, -0.823610f, 0.803882f, 0.505086f, -0.669865f, -0.699709f, -0.003923f,
    -1.388837f, 0.402636f, -0.810574f, 1.579450f, 0.779693f, -0.024508f, -0.323602f, 0.033333f,
    0.003080f, 1.517316f, -0.809160f, 0.816407f, 0.524911f, -0.709322f, -0.700344f, 0.015798f,
    -0.500000f, -0.500000f, -0.500000f, -0.500000f, -0.500000f, -0.500000f, -0.500000f, -0.500000f,
    -0.400000f, -0.400000f, -0.400000f, -0.400000f, -0.400000f, -0.400000f, -0.400000f, -0.400000f,
    -0.600000f, -0.600000f, -0.600000f, -0.600000f, -0.600000f, -0.600000f, -0.600000f, -0.600000f,
    -0.400000f, -0.400000f, -0.400000f, -0.400000f, -0.400000f, -0.400000f, -0.400000f, -0.400000f,
    0.395155f, 0.468205f, 0.501509f, 0.528359f, 0.608316f, 0.673347f, 0.697401f, 0.774661f,
    -0.089886f, -0.098826f, -0.101773f, -0.114628f, -0.116406f, -0.124508f, -0.134509f, -0.145094f,
    -0.080556f, -0.096406f, -0.101444f, -0.114169f, -0.118260f, -0.123214f, -0.138699f, -0.148826f,
    -0.082584f, -0.093333f, -0.100623f, -0.111666f, -0.118821f, -0.126421f, -0.133891f, -0.149550f,
    -0.114508f, -0.122805f, -0.130189f, -0.140683f, -0.141680f, -0.150182f, -0.160128f, -0.170683f,
    0.398150f, 0.448205f, 0.498150f, 0.548205f, 0.601509f, 0.655085f, 0.701509f, 0.755085f,
    -0.081820f, -0.091021f, -0.104508f, -0.111834f, -0.118542f, -0.123224f, -0.134146f, -0.140182f,
    -0.084186f, -0.093711f, -0.103507f, -0.112849f, -0.119772f, -0.124144f, -0.136330f, -0.144881f,
    -0.080182f, -0.091648f, -0.100812f, -0.111648f, -0.119557f, -0.122987f, -0.135074f, -0.144775f,
    -0.082061f, -0.092102f, -0.101854f, -0.111422f, -0.118957f, -0.124508f, -0.135467f, -0.143765f,
    0.395155f, 0.450154f, 0.495155f, 0.550154f, 0.595155f, 0.650154f, 0.695155f, 0.750154f,
    -0.083730f, -0.098826f, -0.100609f, -0.111666f, -0.119707f, -0.124508f, -0.138837f, -0.141870f,
    -0.080556f, -0.098599f, -0.101018f, -0.110182f, -0.118985f, -0.122849f, -0.132607f, -0.142364f,
    -0.082531f, -0.094599f, -0.100344f, -0.114389f, -0.118542f, -0.123224f, -0.138481f, -0.140355f,
    -0.080707f, -0.098018f, -0.100882f, -0.112824f, -0.118817f, -0.125683f, -0.130280f, -0.143587f,
    -0.101820f, -0.113797f, -0.120721f, -0.130683f, -0.140882f, -0.150609f, -0.160144f, -0.170683f,
    -0.104128f, -0.114220f, -0.120609f, -0.130189f, -0.140707f, -0.150330f, -0.160082f, -0.170363f,
    -0.100774f, -0.112849f, -0.120305f, -0.130623f, -0.140683f, -0.150826f, -0.160155f, -0.170067f,
    0.395155f, 0.448205f, 0.501509f, 0.548205f, 0.595155f, 0.655085f, 0.701509f, 0.748205f,
    -0.200000f, -0.200000f, -0.200000f, -0.200000f, -0.200000f, -0.200000f, -0.200000f, -0.200000f,
    -0.200000f, -0.200000f, -0.200000f, -0.200000f, -0.200000f, -0.200000f, -0.200000f, -0.200000f,
    -0.200000f, -0.200000f, -0.200000f, -0.200000f, -0.200000f, -0.200000f, -0.200000f, -0.200000f,
    -0.200000f, -0.200000f, -0.200000f, -0.200000f, -0.200000f, -0.200000f, -0.200000f, -0.200000f,
    -0.200000f, -0.200000f, -0.200000f, -0.200000f, 0.795155f, 0.895155f, 0.995155f, 1.095155f,
    -0.200000f, -0.200000f, -0.200000f, -0.200000f, -0.200000f, -0.200000f, -0.200000f, -0.200000f,
    -0.200000f, -0.200000f, -0.200000f, -0.200000f, -0.200000f, -0.200000f, -0.200000f, -0.200000f,
    -0.200000f, -0.200000f, -0.200000f, -0.200000f, 0.795155f, 0.895155f, 0.995155f, 1.095155f,
    -0.200000f, -0.200000f, -0.200000f, -0.200000f, -0.200000f, -0.200000f, -0.200000f, -0.200000f,
    -0.200000f, -0.200000f, -0.200000f, -0.200000f, -0.200000f, -0.200000f, -0.200000f, -0.200000f,
    -0.200000f, -0.200000f, -0.200000f, -0.200000f, -0.200000f, -0.200000f, -0.200000f, -0.200000f,
    0.795155f, 0.895155f, 0.995155f, 1.095155f, -0.200000f, -0.200000f, -0.200000f, -0.200000f,
    -0.200000f, -0.200000f, -0.200000f, -0.200000f, -0.200000f, -0.200000f, -0.200000f, -0.200000f,
    -0.200000f, -0.200000f, -0.200000f, -0.200000f, 0.795155f, 0.895155f, 0.995155f, 1.095155f,
    1.500000f, 0.800000f, 1.800000f, 1.100000f
};

// Fast RAM Weights Buffer
float nnRAMWeights[1140];

