izaanka/RhythmSleep_v3/esp32s3_rhythmSleep_arduinoide/esp32s3_rhythmSleep_arduinoide.ino
// Display Drivers & Peripherals
RTC_PCF8563 rtc;
Adafruit_SSD1306 oledDisplay(OLED_WIDTH, OLED_HEIGHT, &Wire, OLED_RESET);
Adafruit_ST7789  tftDisplay = Adafruit_ST7789(&SPI, TFT_CS, TFT_DC, TFT_RST);

bool rtcAvailable   = false;
bool oledAvailable  = false;
bool tftAvailable   = false;
bool sdAvailable    = false;  // SD Card status flag
bool bleConnected   = false;  // BLE connection state

// Display Sleep / Backlight Timeout Tracking
unsigned long lastActivityMs = 0;
bool displaySleeping = false;

// TFT Redraw Tracking to Prevent Flickering
uint8_t lastTFTMenu = 255;
uint8_t lastTFTSec  = 255;
int16_t lastTFTFreqBarW = -1;

// FFT Buffers
double vReal[SAMPLES];
double vImag[SAMPLES];
uint16_t sampleIndex = 0;
unsigned long lastSampleMicros = 0;
double currentDominantFreq = 0.0;

// Temporal Feature History Ring Buffer
float featureHistory[HISTORY_LEN][NN_INPUT_SIZE] = {0};
uint8_t historyIndex = 0;
uint8_t historyCount = 0;

// Neural Network Inferred State
enum SleepStage : uint8_t { STAGE_WAKE = 0, STAGE_LIGHT = 1, STAGE_DEEP = 2, STAGE_REM = 3 };
SleepStage currentNNStage = STAGE_WAKE;
float nnConfidences[NN_OUTPUT_SIZE] = {0.25f, 0.25f, 0.25f, 0.25f};
float currentNNConfidence = 0.25f;

// --- 2-Minute Smart Alarm Rolling History Buffer ---
uint8_t sleepStageHistory120[SMART_ALARM_WINDOW_SEC] = {0};
float   lightConfHistory120[SMART_ALARM_WINDOW_SEC]  = {0.0f};
uint16_t history120Index = 0;
uint16_t history120Count = 0;

bool alarmRinging = false;
bool alarmTriggeredToday = false;

// System Sleep Tracking State Machine
enum SystemState { STATE_IDLE = 0, STATE_SLEEPING = 1, STATE_WAKING = 2 };
SystemState systemState = STATE_IDLE;
bool sleepSessionActive = false;
uint16_t autoSleepRelaxationCounter = 0;

// Artifact Rejection & Temporal Context Buffer (30s Context)
#define TEMPORAL_WINDOW_SIZE 6
SleepStage stageContextBuffer[TEMPORAL_WINDOW_SIZE] = {STAGE_WAKE};
uint8_t contextIndex = 0;
bool isArtifactEpoch = false;
uint32_t totalArtifactCount = 0;

// Digital IIR Bandpass Filter State (0.5 - 45 Hz)
double bpX1 = 0, bpX2 = 0, bpY1 = 0, bpY2 = 0;

// On-Device Neural Network Learning Counter
uint32_t nnLearningSessionsCount = 0;

// WiFi, UDP Pairing & Provisioning State
Preferences preferences;
DNSServer dnsServer;
WebServer webServer(80);
WiFiUDP udpSocket;

String wifiSSID = "";
String wifiPass = "";
String serverIP = "";
String pairToken = "";
bool isPaired = false;
bool isAPMode = false;
bool sessionCompletedTrigger = false;
unsigned long lastUDPBroadcast = 0;
unsigned long lastTelemetrySend = 0;
unsigned long lastHeartbeatSend = 0;
uint8_t heartbeatFailCount = 0;

// Menu State: 6 Total Menus
// 0: Time & Date
// 1: EEG Freq & Neural Network Sleep AI
// 2: Smart Alarm Settings
// 3: Bluetooth / Wireless Audio Control & Status
// 4: SD Card Music & Audio File Player
// 5: WiFi, Server Pairing & Factory Reset Menu
uint8_t currentMenu = 0;

// SD Music Player State
#define MAX_SD_FILES 20
String sdFileList[MAX_SD_FILES];
uint8_t sdFileCount = 0;
int8_t  selectedFileIdx = 0;
bool    musicPlaying = false;

// Alarm Configuration
struct AlarmConfig {
  uint8_t startHour = 7;
  uint8_t startMin  = 0;
  uint8_t endHour   = 7;
  uint8_t endMin    = 30;
  bool    enabled   = false;
} alarmCfg;

uint8_t alarmEditField = 0;

// Button Tracking
struct Button {
  uint8_t pin;
  bool currentState;     
  bool previousReading;  
  unsigned long lastDebounceTime;
};

Button btnMenu   = {BTN_MENU_PIN, HIGH, HIGH, 0};
Button btnUp     = {BTN_UP_PIN, HIGH, HIGH, 0};
Button btnDown   = {BTN_DOWN_PIN, HIGH, HIGH, 0};
Button BTNSelect = {BTN_SELECT_PIN, HIGH, HIGH, 0}; // OK / SELECT Button

const unsigned long DEBOUNCE_DELAY = 40;

// Strings
const char* daysOfWeek[] = {"Sun", "Mon", "Tue", "Wed", "Thu", "Fri", "Sat"};
const char* monthsOfYear[] = {"", "Jan", "Feb", "Mar", "Apr", "May", "Jun", "Jul", "Aug", "Sep", "Oct", "Nov", "Dec"};
const char* nnStageNames[] = {"WAKE", "LIGHT", "DEEP", "REM"};

// BLE Server Callbacks
class MyServerCallbacks: public BLEServerCallbacks {
    void onConnect(BLEServer* pServer) {
      bleConnected = true;
      Serial.println("[BLE SUCCESS] Client connected.");
    };

    void onDisconnect(BLEServer* pServer) {
      bleConnected = false;
      Serial.println("[BLE NOTICE] Client disconnected. Restarting advertising...");
      BLEDevice::startAdvertising();
    }
};

// ===================================================================
// Audio Driver via ESP32 Hardware LEDC Timer
// ===================================================================

void initAudioSpeaker() {
  pinMode(USB_AUDIO_DP_PIN, OUTPUT);
  pinMode(USB_AUDIO_DN_PIN, OUTPUT);
  digitalWrite(USB_AUDIO_DP_PIN, LOW);
  digitalWrite(USB_AUDIO_DN_PIN, LOW);

  // Attach LEDC timer for non-blocking hardware tone generation on GPIO 20
#if defined(ESP_ARDUINO_VERSION_MAJOR) && (ESP_ARDUINO_VERSION_MAJOR >= 3)
  ledcAttach(USB_AUDIO_DP_PIN, 440, 8);
  ledcWrite(USB_AUDIO_DP_PIN, 0);
#else
  ledcSetup(LEDC_AUDIO_CH, 440, 8);
  ledcAttachPin(USB_AUDIO_DP_PIN, LEDC_AUDIO_CH);
  ledcWrite(LEDC_AUDIO_CH, 0);
#endif

  Serial.println("[AUDIO SUCCESS] Hardware LEDC Audio initialized on GPIO 20 (D+) & GPIO 19 (D-).");
}

void playTone(uint32_t freq) {
  if (freq == 0) {
#if defined(ESP_ARDUINO_VERSION_MAJOR) && (ESP_ARDUINO_VERSION_MAJOR >= 3)
    ledcWrite(USB_AUDIO_DP_PIN, 0);
#else
    ledcWrite(LEDC_AUDIO_CH, 0);
#endif
  } else {
#if defined(ESP_ARDUINO_VERSION_MAJOR) && (ESP_ARDUINO_VERSION_MAJOR >= 3)
    ledcWriteTone(USB_AUDIO_DP_PIN, freq);
#else
    ledcWriteTone(LEDC_AUDIO_CH, freq);
#endif
  }
}

// ===================================================================
// SD Card Helper & File Scanner
// ===================================================================

void deselectSPI() {
  digitalWrite(SD_CS_PIN, HIGH);
  digitalWrite(TFT_CS, HIGH);
}

void scanSDFiles() {
  sdFileCount = 0;
  if (!sdAvailable) return;

  digitalWrite(TFT_CS, HIGH);
  digitalWrite(SD_CS_PIN, LOW);

  File root = SD.open("/");
  if (!root) {
    digitalWrite(SD_CS_PIN, HIGH);
    return;
  }

  File file = root.openNextFile();
  while (file && sdFileCount < MAX_SD_FILES) {
    if (!file.isDirectory()) {
      String name = String(file.name());
      if (name.endsWith(".wav") || name.endsWith(".WAV") || name.endsWith(".mp3") || name.endsWith(".MP3") || name.endsWith(".txt")) {
        sdFileList[sdFileCount++] = name;
      }
    }
    file = root.openNextFile();
  }
  root.close();
  digitalWrite(SD_CS_PIN, HIGH);
  Serial.printf("[SD MUSIC] Found %d audio files on SD Card.\n", sdFileCount);
}

void checkSDCardDetection() {
  pinMode(SD_VCC_PIN, OUTPUT);
  digitalWrite(SD_VCC_PIN, HIGH);
  pinMode(SD_GND_PIN, OUTPUT);
  digitalWrite(SD_GND_PIN, LOW);
  delay(50);

  pinMode(SD_CS_PIN, OUTPUT);
  digitalWrite(SD_CS_PIN, HIGH);
  pinMode(TFT_CS, OUTPUT);
  digitalWrite(TFT_CS, HIGH);

  delay(20);

  SPI.begin(SPI_SCLK_PIN, SPI_MISO_PIN, SPI_MOSI_PIN, SD_CS_PIN);

  digitalWrite(SD_CS_PIN, HIGH);
  for (int i = 0; i < 10; i++) {
    SPI.transfer(0xFF);
  }

  bool mounted = SD.begin(SD_CS_PIN, SPI, 4000000);
  if (!mounted) {
    delay(50);
    mounted = SD.begin(SD_CS_PIN, SPI, 400000);
  }

  if (mounted) {
    uint8_t cardType = SD.cardType();
    if (cardType != CARD_NONE) {
      sdAvailable = true;
      uint64_t cardSize = SD.cardSize() / (1024 * 1024);
      Serial.printf("[SD CARD SUCCESS] SD Card detected. Capacity: %llu MB\n", cardSize);
      scanSDFiles();
    } else {
      sdAvailable = false;
      Serial.println("[SD CARD NOTICE] SD Card module connected, but slot is EMPTY.");
    }
  } else {
    sdAvailable = false;
    Serial.println("[SD CARD NOTICE] SD Card mount failed or module NOT connected.");
  }

  digitalWrite(SD_CS_PIN, HIGH);
}

// ===================================================================
// Bluetooth BLE Initialization
// ===================================================================

void initBLE() {
  BLEDevice::init("RhythmSleep_AI");
  BLEServer *pServer = BLEDevice::createServer();
  pServer->setCallbacks(new MyServerCallbacks());
  
