izaanka/RhythmSleep_v3/esp32s3_rhythmSleep_arduinoide/esp32s3_rhythmSleep_arduinoide.ino
  BLEService *pService = pServer->createService("180D"); // Heart Rate / Audio Service UUID
  pService->start();
  
  BLEAdvertising *pAdvertising = BLEDevice::getAdvertising();
  pAdvertising->addServiceUUID("180D");
  pAdvertising->setScanResponse(true);
  pAdvertising->setMinPreferred(0x06);
  pAdvertising->setMinPreferred(0x12);
  BLEDevice::startAdvertising();

  Serial.println("[BLE SUCCESS] BLE Server active as 'RhythmSleep_AI'. Advertising...");
}

// ===================================================================
// Display Helpers & Redraw
// ===================================================================

const char* getEEGBand(double freq) {
  if (freq < 4.0) return "Delta (Deep)";
  if (freq < 8.0) return "Theta (Drowsy)";
  if (freq < 13.0) return "Alpha (Relaxed)";
  if (freq < 30.0) return "Beta (Active)";
  return "Gamma (High)";
}

void wakeUpDisplay() {
  lastActivityMs = millis();
  if (displaySleeping) {
    displaySleeping = false;
    digitalWrite(TFT_BLK, HIGH);
    if (oledAvailable) {
      oledDisplay.ssd1306_command(SSD1306_DISPLAYON);
    }
    Serial.println("[POWER] TFT & OLED Displays woken up by user interaction.");
    lastTFTMenu = 255;
  }
}

// ===================================================================
// OLED Rendering Functions (5 Menus)
// ===================================================================

void renderMenuTime(const DateTime &now) {
  oledDisplay.setTextSize(1);
  oledDisplay.setCursor(0, 0);
  oledDisplay.print("[1/6] TIME & DATE");
  oledDisplay.drawFastHLine(0, 11, 128, SSD1306_WHITE);

  char timeBuffer[10];
  snprintf(timeBuffer, sizeof(timeBuffer), "%02d:%02d:%02d", now.hour(), now.minute(), now.second());
  oledDisplay.setTextSize(2);
  oledDisplay.setCursor(16, 18);
  oledDisplay.print(timeBuffer);

  oledDisplay.drawFastHLine(0, 38, 128, SSD1306_WHITE);

  char dateBuffer[25];
  snprintf(dateBuffer, sizeof(dateBuffer), "%s, %02d %s %04d", 
           daysOfWeek[now.dayOfTheWeek()], now.day(), monthsOfYear[now.month()], now.year());
  
  oledDisplay.setTextSize(1);
  int16_t x1, y1; uint16_t w, h;
  oledDisplay.getTextBounds(dateBuffer, 0, 0, &x1, &y1, &w, &h);
  oledDisplay.setCursor((128 - w) / 2, 44);
  oledDisplay.print(dateBuffer);
}

void renderMenuEEG() {
  oledDisplay.setTextSize(1);
  oledDisplay.setCursor(0, 0);
  oledDisplay.print("[2/6] EEG REAL-TIME");
  oledDisplay.drawFastHLine(0, 11, 128, SSD1306_WHITE);

  oledDisplay.setCursor(0, 15);
  oledDisplay.printf("Peak Freq: %.2f Hz", currentDominantFreq);

  oledDisplay.setCursor(0, 27);
  oledDisplay.printf("NN: %s (%.0f%%)", nnStageNames[currentNNStage], currentNNConfidence * 100.0f);

  oledDisplay.drawFastHLine(0, 38, 128, SSD1306_WHITE);

  oledDisplay.setCursor(0, 42);
  if (sleepSessionActive) {
    if (currentNNStage == STAGE_WAKE) {
      oledDisplay.print("Mode: PRE-SLEEP AWAIT");
    } else {
      oledDisplay.print("Mode: SLEEPING");
    }
  } else {
    oledDisplay.print("Mode: IDLE (SEL:Start)");
  }

  oledDisplay.setCursor(0, 54);
  oledDisplay.printf("AI Model: v%d (Learned)", nnLearningSessionsCount);
}

void renderMenuNNStats() {
  oledDisplay.setTextSize(1);
  oledDisplay.setCursor(0, 0);
  oledDisplay.print("[3/6] NEURAL AI STATS");
  oledDisplay.drawFastHLine(0, 11, 128, SSD1306_WHITE);

  int calcLearned = (nnLearningSessionsCount == 0) ? 15 : (nnLearningSessionsCount * 20);
  uint8_t pctLearned = (calcLearned > 100) ? 100 : (uint8_t)calcLearned;
  int calcOpt = pctLearned + 10;
  uint8_t pctOptimized = (calcOpt > 100) ? 100 : (uint8_t)calcOpt;

  oledDisplay.setCursor(0, 15);
  oledDisplay.printf("AI Learned: %d%%", pctLearned);

  oledDisplay.setCursor(0, 27);
  oledDisplay.printf("Optimized : %d%%", pctOptimized);

  oledDisplay.setCursor(0, 39);
  oledDisplay.printf("Passes    : %d Backprop", nnLearningSessionsCount);

  oledDisplay.setCursor(0, 51);
  oledDisplay.printf("NVS Memory: %s", nnLearningSessionsCount > 0 ? "SYNCED" : "DEFAULT");
}

void renderMenuAlarm() {
  oledDisplay.setTextSize(1);
  oledDisplay.setCursor(0, 0);
  oledDisplay.print("[4/6] SMART ALARM");
  oledDisplay.drawFastHLine(0, 11, 128, SSD1306_WHITE);

  oledDisplay.setCursor(0, 16);
  oledDisplay.print("Start: ");
  if (alarmEditField == 1) oledDisplay.print(">");
  oledDisplay.printf("%02d", alarmCfg.startHour);
  oledDisplay.print(":");
  if (alarmEditField == 2) oledDisplay.print(">");
  oledDisplay.printf("%02d", alarmCfg.startMin);

  oledDisplay.setCursor(0, 28);
  oledDisplay.print("End:   ");
  if (alarmEditField == 3) oledDisplay.print(">");
  oledDisplay.printf("%02d", alarmCfg.endHour);
  oledDisplay.print(":");
  if (alarmEditField == 4) oledDisplay.print(">");
  oledDisplay.printf("%02d", alarmCfg.endMin);

  oledDisplay.setCursor(0, 40);
  oledDisplay.print("State: ");
  if (alarmEditField == 5) oledDisplay.print(">");
  oledDisplay.print(alarmCfg.enabled ? "[ SMART ON ]" : "[ OFF ]");

  oledDisplay.setCursor(0, 52);
  if (alarmEditField > 0) {
    oledDisplay.print("UP/DN:(5m) SEL:Next");
  } else {
    oledDisplay.print("SEL:Edit UP/DN:Tgl");
  }
}

// ===================================================================
// On-Device Neural Network Online Backpropagation Learning Engine
// ===================================================================

void loadNNWeights() {
  preferences.begin("nn_weights", true);
  size_t len = preferences.getBytesLength("weights");
  if (len == sizeof(nnRAMWeights)) {
    preferences.getBytes("weights", nnRAMWeights, sizeof(nnRAMWeights));
    nnLearningSessionsCount = preferences.getUInt("learn_count", 0);
    Serial.printf("[NN NVS SUCCESS] Loaded customized weights from NVS (Sessions Trained: %d).\n", nnLearningSessionsCount);
  } else {
    for (int i = 0; i < 1140; i++) {
      nnRAMWeights[i] = pgm_read_float(&DEFAULT_NN_WEIGHTS[i]);
    }
    Serial.println("[NN NVS NOTICE] Initialized RAM neural network with factory weights.");
  }
  preferences.end();
}

void saveNNWeights() {
  preferences.begin("nn_weights", false);
  preferences.putBytes("weights", nnRAMWeights, sizeof(nnRAMWeights));
  preferences.putUInt("learn_count", ++nnLearningSessionsCount);
  preferences.end();
  Serial.printf("[NN LEARNING SUCCESS] Saved recalibrated weights to NVS (Total Learn Sessions: %d).\n", nnLearningSessionsCount);
}

// On-Device Backpropagation Gradient Descent Pass (16 -> 32 -> 16 -> 4 MLP)
void trainNNOnDevice(const float inputs[16], uint8_t targetStage, float learningRate) {
  float out1[32], out2[16], out3[4];
  float z1[32], z2[16], z3[4];

  float* w1 = &nnRAMWeights[0];    // 16x32 = 512
  float* b1 = &nnRAMWeights[512];  // 32
  float* w2 = &nnRAMWeights[544];  // 32x16 = 512
  float* b2 = &nnRAMWeights[1056]; // 16
  float* w3 = &nnRAMWeights[1072]; // 16x4 = 64
  float* b3 = &nnRAMWeights[1136]; // 4

  // Forward Pass Layer 1
  for (int j = 0; j < 32; j++) {
    float sum = b1[j];
    for (int i = 0; i < 16; i++) sum += inputs[i] * w1[i * 32 + j];
    z1[j] = sum;
    out1[j] = (sum > 0.0f) ? sum : 0.0f; // ReLU
  }

  // Forward Pass Layer 2
  for (int j = 0; j < 16; j++) {
    float sum = b2[j];
    for (int i = 0; i < 32; i++) sum += out1[i] * w2[i * 16 + j];
    z2[j] = sum;
    out2[j] = (sum > 0.0f) ? sum : 0.0f; // ReLU
  }

  // Forward Pass Layer 3 (Softmax)
  float maxZ = -999.0f;
  for (int k = 0; k < 4; k++) {
    float sum = b3[k];
    for (int j = 0; j < 16; j++) sum += out2[j] * w3[j * 4 + k];
    z3[k] = sum;
    if (sum > maxZ) maxZ = sum;
  }

