izaanka/RhythmSleep_v3/esp32s3_rhythmSleep_arduinoide/esp32s3_rhythmSleep_arduinoide.ino
  float expSum = 0.0f;
  for (int k = 0; k < 4; k++) {
    out3[k] = expf(z3[k] - maxZ);
    expSum += out3[k];
  }
  for (int k = 0; k < 4; k++) out3[k] /= expSum;

  // Backprop Output Gradients
  float delta3[4];
  for (int k = 0; k < 4; k++) {
    float target = (k == targetStage) ? 1.0f : 0.0f;
    delta3[k] = out3[k] - target;
  }

  // Backprop Layer 2 Gradients
  float delta2[16];
  for (int j = 0; j < 16; j++) {
    float sum = 0.0f;
    for (int k = 0; k < 4; k++) sum += delta3[k] * w3[j * 4 + k];
    delta2[j] = (z2[j] > 0.0f) ? sum : 0.0f;
  }

  // Backprop Layer 1 Gradients
  float delta1[32];
  for (int i = 0; i < 32; i++) {
    float sum = 0.0f;
    for (int j = 0; j < 16; j++) sum += delta2[j] * w2[i * 16 + j];
    delta1[i] = (z1[i] > 0.0f) ? sum : 0.0f;
  }

  const float lambda = 0.00001f; // L2 Regularization

  // Update Layer 3
  for (int j = 0; j < 16; j++) {
    for (int k = 0; k < 4; k++) {
      float grad = delta3[k] * out2[j] + lambda * w3[j * 4 + k];
      w3[j * 4 + k] -= learningRate * grad;
    }
  }
  for (int k = 0; k < 4; k++) b3[k] -= learningRate * delta3[k];

  // Update Layer 2
  for (int i = 0; i < 32; i++) {
    for (int j = 0; j < 16; j++) {
      float grad = delta2[j] * out1[i] + lambda * w2[i * 16 + j];
      w2[i * 16 + j] -= learningRate * grad;
    }
  }
  for (int j = 0; j < 16; j++) b2[j] -= learningRate * delta2[j];

  // Update Layer 1
  for (int i = 0; i < 16; i++) {
    for (int j = 0; j < 32; j++) {
      float grad = delta1[j] * inputs[i] + lambda * w1[i * 32 + j];
      w1[i * 32 + j] -= learningRate * grad;
    }
  }
  for (int j = 0; j < 32; j++) b1[j] -= learningRate * delta1[j];
}

void runOnDeviceLearningPass() {
  Serial.println("[NN LEARNING] Executing On-Device Backpropagation Weight Recorrection...");
  if (historyCount > 0) {
    for (int pass = 0; pass < 5; pass++) {
      for (int h = 0; h < historyCount; h++) {
        trainNNOnDevice(featureHistory[h], (uint8_t)STAGE_LIGHT, 0.005f);
      }
    }
    saveNNWeights();
  }
}

// Digital IIR Bandpass Filter (0.5 - 45 Hz @ 256Hz Sampling)
double applyBandpassFilter(double sample) {
  double filtered = 0.245 * (sample - bpX2) + 1.307 * bpY1 - 0.510 * bpY2;
  bpX2 = bpX1;
  bpX1 = sample;
  bpY2 = bpY1;
  bpY1 = filtered;
  return filtered;
}

// 30-Second Temporal Context Majority Voting
SleepStage applyTemporalMajorityFilter(SleepStage rawStage) {
  stageContextBuffer[contextIndex] = rawStage;
  contextIndex = (contextIndex + 1) % TEMPORAL_WINDOW_SIZE;

  uint8_t counts[4] = {0};
  for (int i = 0; i < TEMPORAL_WINDOW_SIZE; i++) {
    counts[stageContextBuffer[i]]++;
  }

  SleepStage bestStage = rawStage;
  uint8_t maxCount = 0;
  for (int s = 0; s < 4; s++) {
    if (counts[s] > maxCount) {
      maxCount = counts[s];
      bestStage = (SleepStage)s;
    }
  }
  return bestStage;
}



void renderOLEDAlarmRinging(const DateTime &now) {
  oledDisplay.setTextSize(1);
  oledDisplay.setCursor(15, 5);
  oledDisplay.print("*** WAKE UP! ***");
  oledDisplay.drawFastHLine(0, 18, 128, SSD1306_WHITE);

  char tBuf[10];
  snprintf(tBuf, sizeof(tBuf), "%02d:%02d:%02d", now.hour(), now.minute(), now.second());
  oledDisplay.setTextSize(2);
  oledDisplay.setCursor(16, 25);
  oledDisplay.print(tBuf);

  oledDisplay.setTextSize(1);
  oledDisplay.setCursor(15, 48);
  oledDisplay.print("Press OK to stop");
}

// ===================================================================
// WiFi Provisioning, UDP Server Pairing & Factory Reset Routines
// ===================================================================

void performFactoryReset() {
  Serial.println("[FACTORY RESET] Clearing WiFi and Server pairing settings...");
  
  digitalWrite(SD_CS_PIN, HIGH);
  digitalWrite(TFT_CS, LOW);
  tftDisplay.fillScreen(ST7789_RED);
  tftDisplay.setTextColor(ST7789_WHITE);
  tftDisplay.setTextSize(3);
  tftDisplay.setCursor(20, 70);
  tftDisplay.print("FACTORY RESET");
  tftDisplay.setTextSize(2);
  tftDisplay.setCursor(20, 120);
  tftDisplay.print("Wiping credentials...");
  tftDisplay.setCursor(20, 150);
  tftDisplay.print("Restarting into AP mode");
  digitalWrite(TFT_CS, HIGH);

  if (oledAvailable) {
    oledDisplay.clearDisplay();
    oledDisplay.setTextColor(SSD1306_WHITE);
    oledDisplay.setTextSize(2);
    oledDisplay.setCursor(10, 15);
    oledDisplay.print("RESETTING");
    oledDisplay.setTextSize(1);
    oledDisplay.setCursor(10, 45);
    oledDisplay.print("Wiping credentials...");
    oledDisplay.display();
  }

  preferences.begin("rhythm_cfg", false);
  preferences.clear();
  preferences.end();

  delay(2000);
  ESP.restart();
}

void setupWebServerRoutes() {
  auto serveRootHTML = []() {
    String html = "<!DOCTYPE html><html><head><meta charset='UTF-8'><meta name='viewport' content='width=device-width,initial-scale=1'>";
    html += "<title>RhythmSleep Wi-Fi Setup</title>";
    html += "<style>body{font-family:sans-serif;background:#0f172a;color:#fff;padding:20px;text-align:center}";
    html += "input,select{width:100%;padding:12px;margin:8px 0;border-radius:8px;border:1px solid #334155;background:#1e293b;color:#fff;box-sizing:border-box}";
    html += "input[type=submit]{background:#00f2fe;color:#000;font-weight:bold;cursor:pointer}</style></head><body>";
    html += "<h2>RhythmSleep Wi-Fi Setup</h2>";
    html += "<p>Configure ESP32 Wi-Fi Connection</p>";
    html += "<form action='/save' method='POST'>";
    
    int n = WiFi.scanComplete();
    if (n == -2) {
      WiFi.scanNetworks(true);
    } else if (n > 0) {
      html += "<label>Scanned Networks:</label><br>";
      html += "<select onchange='document.getElementById(\"ssid\").value=this.value'>";
      html += "<option value=''>-- Select Network --</option>";
      for (int i = 0; i < n; ++i) {
        html += "<option value='" + WiFi.SSID(i) + "'>" + WiFi.SSID(i) + " (" + String(WiFi.RSSI(i)) + " dBm)</option>";
      }
      html += "</select><br>";
      WiFi.scanDelete();
      WiFi.scanNetworks(true);
    }

    html += "<label>Wi-Fi Name (SSID):</label><br>";
    html += "<input type='text' id='ssid' name='ssid' placeholder='Enter SSID' required><br>";
    html += "<label>Wi-Fi Password:</label><br>";
    html += "<input type='password' name='pass' placeholder='Enter Password'><br>";
    html += "<input type='submit' value='Save & Connect'>";
    html += "</form></body></html>";

