izaanka/RhythmSleep_v3/esp32s3_rhythmSleep_arduinoide/esp32s3_rhythmSleep_arduinoide.ino
    webServer.sendHeader("Cache-Control", "no-cache, no-store, must-revalidate");
    webServer.sendHeader("Pragma", "no-cache");
    webServer.sendHeader("Expires", "-1");
    webServer.send(200, "text/html", html);
  };

  webServer.on("/", HTTP_GET, [serveRootHTML]() {
    if (!isAPMode && isPaired && serverIP.length() > 0) {
      String target = "http://" + serverIP + ":3000/";
      webServer.sendHeader("Location", target, true);
      webServer.send(302, "text/plain", "Redirecting to Server @ " + target);
      Serial.printf("[HTTP REDIRECT] Redirecting browser to Server: %s\n", target.c_str());
    } else {
      serveRootHTML();
    }
  });
  webServer.on("/generate_204", HTTP_GET, serveRootHTML);
  webServer.on("/gen_204", HTTP_GET, serveRootHTML);
  webServer.on("/hotspot-detect.html", HTTP_GET, serveRootHTML);
  webServer.on("/connecttest.txt", HTTP_GET, serveRootHTML);
  webServer.on("/redirect", HTTP_GET, serveRootHTML);
  webServer.on("/canonical.html", HTTP_GET, serveRootHTML);

  webServer.on("/save", HTTP_POST, []() {
    String newSSID = webServer.arg("ssid");
    String newPass = webServer.arg("pass");

    if (newSSID.length() > 0) {
      preferences.begin("rhythm_cfg", false);
      preferences.putString("ssid", newSSID);
      preferences.putString("pass", newPass);
      preferences.end();

      String res = "<!DOCTYPE html><html><body style='background:#0f172a;color:#00f2fe;font-family:sans-serif;text-align:center;padding:50px'>";
      res += "<h2>WiFi Saved!</h2><p>RhythmSleep ESP32 is restarting and connecting to " + newSSID + "...</p></body></html>";
      webServer.send(200, "text/html", res);

      delay(1500);
      ESP.restart();
    } else {
      webServer.send(400, "text/plain", "Missing SSID");
    }
  });

  webServer.on("/api/pair", HTTP_POST, []() {
    String postBody = webServer.arg("plain");
    String newServerIP = webServer.arg("server_ip");
    String newToken = webServer.arg("token");
    
    if (newServerIP.length() == 0 && postBody.length() > 0) {
      int ipIdx = postBody.indexOf("\"server_ip\":\"");
      if (ipIdx != -1) {
        int ipEnd = postBody.indexOf("\"", ipIdx + 13);
        if (ipEnd != -1) newServerIP = postBody.substring(ipIdx + 13, ipEnd);
      }
      int tokIdx = postBody.indexOf("\"token\":\"");
      if (tokIdx != -1) {
        int tokEnd = postBody.indexOf("\"", tokIdx + 9);
        if (tokEnd != -1) newToken = postBody.substring(tokIdx + 9, tokEnd);
      }
    }

    if (newServerIP.length() > 0) {
      serverIP = newServerIP;
      pairToken = (newToken.length() > 0) ? newToken : "RS-PAIR-MANUAL";
      isPaired = true;

      preferences.begin("rhythm_cfg", false);
      preferences.putString("server_ip", serverIP);
      preferences.putString("token", pairToken);
      preferences.putBool("is_paired", true);
      preferences.end();

      Serial.printf("[MANUAL PAIR HTTP] Paired with Server: %s | Token: %s\n", serverIP.c_str(), pairToken.c_str());
      fetchServerTime();

      String res = "{\"status\":\"ok\",\"mac\":\"" + WiFi.macAddress() + "\",\"ip\":\"" + WiFi.localIP().toString() + "\",\"paired\":true}";
      webServer.send(200, "application/json", res);
    } else {
      webServer.send(400, "application/json", "{\"error\":\"Missing server_ip\"}");
    }
  });

  webServer.on("/api/status", HTTP_GET, []() {
    String res = "{\"status\":\"ok\",\"mac\":\"" + WiFi.macAddress() + "\",\"ip\":\"" + WiFi.localIP().toString() + "\",\"is_paired\":" + String(isPaired ? "true" : "false") + ",\"server_ip\":\"" + serverIP + "\"}";
    webServer.send(200, "application/json", res);
  });

  webServer.onNotFound([serveRootHTML]() {
    if (!isAPMode && isPaired && serverIP.length() > 0) {
      String target = "http://" + serverIP + ":3000/";
      webServer.sendHeader("Location", target, true);
      webServer.send(302, "text/plain", "");
    } else {
      serveRootHTML();
    }
  });
}

void startSoftAP() {
  if (isAPMode) return;
  isAPMode = true;
  WiFi.mode(WIFI_AP_STA);
  IPAddress apIP(192, 168, 4, 1);
  IPAddress netMask(255, 255, 255, 0);
  WiFi.softAPConfig(apIP, apIP, netMask);

  if (wifiSSID.length() > 0 && wifiPass.length() > 0) {
    WiFi.softAP("RhythmSleep-Setup", wifiPass.c_str());
    Serial.printf("[WIFI AP ACTIVE] SoftAP active as 'RhythmSleep-Setup' (Password Protected) at 192.168.4.1\n");
  } else {
    WiFi.softAP("RhythmSleep-Setup");
    Serial.printf("[WIFI AP ACTIVE] SoftAP active as 'RhythmSleep-Setup' (Open) at 192.168.4.1\n");
  }
  delay(100);

  dnsServer.start(53, "*", apIP);
  setupWebServerRoutes();
  webServer.begin();
  WiFi.scanNetworks(true);
}

void stopSoftAP() {
  if (isAPMode) {
    dnsServer.stop();
    WiFi.softAPdisconnect(true);
    WiFi.mode(WIFI_STA);
    isAPMode = false;
    Serial.println("[WIFI AP CLOSED] Connected to Wi-Fi! SoftAP turned OFF.");
  }
}

void initWiFiProvisioning() {
  preferences.begin("rhythm_cfg", false);
  wifiSSID  = preferences.getString("ssid", "");
  wifiPass  = preferences.getString("pass", "");
  serverIP  = preferences.getString("server_ip", "");
  pairToken = preferences.getString("token", "");
  isPaired  = preferences.getBool("is_paired", false);
  preferences.end();

  if (wifiSSID.length() > 0) {
    Serial.printf("[WIFI STA] Connecting to saved SSID: %s...\n", wifiSSID.c_str());
    WiFi.mode(WIFI_STA);
    WiFi.begin(wifiSSID.c_str(), wifiPass.c_str());

    unsigned long startMs = millis();
    while (WiFi.status() != WL_CONNECTED && (millis() - startMs < 8000)) {
      delay(250);
      Serial.print(".");
    }
    Serial.println();

    if (WiFi.status() == WL_CONNECTED) {
      isAPMode = false;
      Serial.printf("[WIFI SUCCESS] Connected! IP: %s (SoftAP Disabled)\n", WiFi.localIP().toString().c_str());
      udpSocket.begin(8888);
      setupWebServerRoutes();
      webServer.begin();
      fetchServerTime();
      return;
    } else {
      Serial.println("[WIFI NOTICE] Connection failed/timed out. Enabling password-protected SoftAP.");
    }
  }

