izaanka/RhythmSleep_v3/esp32s3_rhythmSleep_arduinoide/esp32s3_rhythmSleep_arduinoide.ino
  startSoftAP();
}

uint32_t unixTimeOffset = 0; // Difference between millis()/1000 and actual Unix Epoch time

void setSystemUnixTime(uint32_t epoch) {
  if (epoch > 1700000000) {
    unixTimeOffset = epoch - (millis() / 1000);
    if (rtcAvailable) {
      rtc.adjust(DateTime(epoch));
    }
    Serial.printf("[TIME SYNC SUCCESS] System time set to Server Unix Epoch: %u\n", epoch);
  }
}

DateTime getCurrentTime() {
  if (rtcAvailable) {
    return rtc.now();
  }
  if (unixTimeOffset > 0) {
    uint32_t currentEpoch = (millis() / 1000) + unixTimeOffset;
    return DateTime(currentEpoch);
  }
  return DateTime(2026, 8, 18, (millis()/3600000)%24, (millis()/60000)%60, (millis()/1000)%60);
}

void fetchServerTime() {
  if (WiFi.status() == WL_CONNECTED) {
    String host = (serverIP.length() > 0) ? serverIP : WiFi.gatewayIP().toString();
    if (host.length() == 0 || host == "0.0.0.0") return;

    HTTPClient http;
    String url = "http://" + host + ":3000/api/time";
    http.begin(url);
    http.setTimeout(3000);
    int httpCode = http.GET();
    if (httpCode == 200) {
      String resp = http.getString();
      int timeIdx = resp.indexOf("\"server_time\":");
      if (timeIdx != -1) {
        String numStr = resp.substring(timeIdx + 14);
        uint32_t sTime = (uint32_t)numStr.toInt();
        setSystemUnixTime(sTime);
      }
    }
    http.end();
  }
}

void handlePairingAndTelemetry() {
  if (isAPMode) {
    dnsServer.processNextRequest();
    webServer.handleClient();

    if (WiFi.status() == WL_CONNECTED) {
      stopSoftAP();
      udpSocket.begin(8888);
      setupWebServerRoutes();
      webServer.begin();
    }
    return;
  }

  webServer.handleClient();

  if (WiFi.status() != WL_CONNECTED) {
    startSoftAP();
    return;
  }

  // --- UNPAIRED STATE: Active Multi-Channel Discovery & Auto-Pairing ---
  if (!isPaired) {
    if (millis() - lastUDPBroadcast >= 2500) {
      lastUDPBroadcast = millis();

      String macStr = WiFi.macAddress();
      String localIpStr = WiFi.localIP().toString();
      String discoverMsg = "{\"type\":\"DISCOVER\",\"mac\":\"" + macStr + "\",\"ip\":\"" + localIpStr + "\",\"model\":\"RhythmSleep_v3\"}";
      
      // 1. Global Broadcast (255.255.255.255)
      udpSocket.beginPacket("255.255.255.255", 8888);
      udpSocket.print(discoverMsg);
      udpSocket.endPacket();

      // 2. Subnet Broadcast (e.g. 192.168.1.255)
      IPAddress localIP = WiFi.localIP();
      IPAddress subnetBC(localIP[0], localIP[1], localIP[2], 255);
      udpSocket.beginPacket(subnetBC, 8888);
      udpSocket.print(discoverMsg);
      udpSocket.endPacket();

      // 3. Unicast to Gateway
      IPAddress gwIP = WiFi.gatewayIP();
      if (gwIP[0] != 0 && gwIP != localIP) {
        udpSocket.beginPacket(gwIP, 8888);
        udpSocket.print(discoverMsg);
        udpSocket.endPacket();
      }

      // 4. If we had a previously saved server IP, send UDP unicast directly to it
      if (serverIP.length() > 0 && serverIP != "0.0.0.0" && serverIP != "---") {
        udpSocket.beginPacket(serverIP.c_str(), 8888);
        udpSocket.print(discoverMsg);
        udpSocket.endPacket();
      }

      // 5. Send Discovery probe over Serial
      Serial.printf("[DISCOVER PROBE] ESP32 MAC:%s IP:%s (Searching for RhythmSleep Server...)\n", macStr.c_str(), localIpStr.c_str());

      // 6. Direct HTTP Pairing Fallback (try saved serverIP first, then gateway)
      String targetHost = (serverIP.length() > 0 && serverIP != "0.0.0.0" && serverIP != "---") ? serverIP : gwIP.toString();
      if (targetHost.length() > 0 && targetHost != "0.0.0.0") {
        HTTPClient httpPair;
        httpPair.begin("http://" + targetHost + ":3000/api/pair");
        httpPair.addHeader("Content-Type", "application/json");
        httpPair.setTimeout(1500);
        String pairReqBody = "{\"mac\":\"" + macStr + "\",\"ip\":\"" + localIpStr + "\",\"type\":\"DISCOVER\"}";
        int pairCode = httpPair.POST(pairReqBody);
        if (pairCode == 200) {
          String payload = httpPair.getString();
          int tokIdx = payload.indexOf("\"token\":\"");
          int ipIdx = payload.indexOf("\"server_ip\":\"");
          if (tokIdx != -1) {
            int tokEnd = payload.indexOf("\"", tokIdx + 9);
            if (tokEnd != -1) {
              pairToken = payload.substring(tokIdx + 9, tokEnd);
              if (ipIdx != -1) {
                int ipEnd = payload.indexOf("\"", ipIdx + 13);
                if (ipEnd != -1) serverIP = payload.substring(ipIdx + 13, ipEnd);
              } else {
                serverIP = targetHost;
              }
              isPaired = true;
              heartbeatFailCount = 0;
              preferences.begin("rhythm_cfg", false);
              preferences.putString("server_ip", serverIP);
              preferences.putString("token", pairToken);
              preferences.putBool("is_paired", true);
              preferences.end();
              Serial.printf("[HTTP PAIR SUCCESS] Paired with Server IP: %s | Token: %s\n", serverIP.c_str(), pairToken.c_str());
              fetchServerTime();
            }
          }
        }
        httpPair.end();
      }
    }

    // Check incoming UDP PAIR_ACK packet
    int packetSize = udpSocket.parsePacket();
    if (packetSize > 0) {
      char packetBuffer[256];
      int len = udpSocket.read(packetBuffer, 255);
      if (len > 0) packetBuffer[len] = 0;

      String payload = String(packetBuffer);
      Serial.printf("[UDP ACK RECEIVED] %s\n", payload.c_str());

      if (payload.indexOf("PAIR_ACK") != -1) {
        int ipIdx = payload.indexOf("\"server_ip\":\"");
        int tokIdx = payload.indexOf("\"token\":\"");
        if (ipIdx != -1 && tokIdx != -1) {
          int ipEnd = payload.indexOf("\"", ipIdx + 13);
          int tokEnd = payload.indexOf("\"", tokIdx + 9);

          if (ipEnd != -1 && tokEnd != -1) {
            serverIP = payload.substring(ipIdx + 13, ipEnd);
            pairToken = payload.substring(tokIdx + 9, tokEnd);
            isPaired = true;
            heartbeatFailCount = 0;

            preferences.begin("rhythm_cfg", false);
            preferences.putString("server_ip", serverIP);
            preferences.putString("token", pairToken);
            preferences.putBool("is_paired", true);
            preferences.end();

            Serial.printf("[UDP PAIR SUCCESS] Connected to Server: %s | Token: %s\n", serverIP.c_str(), pairToken.c_str());
            fetchServerTime();
          }
        }
      }
    }
  } 
  // --- PAIRED STATE: Handshake Heartbeats & Telemetry Stream ---
  else {
    // 1. Periodic Time Sync (every 60s)
    static unsigned long lastTimeSyncMs = 0;
    if (millis() - lastTimeSyncMs >= 60000 || lastTimeSyncMs == 0) {
      lastTimeSyncMs = millis();
      fetchServerTime();
    }

    // 2. Regular Connection Heartbeat Handshake (every 5 seconds)
    if (millis() - lastHeartbeatSend >= 5000) {
      lastHeartbeatSend = millis();

      HTTPClient httpHb;
      String hbUrl = "http://" + serverIP + ":3000/api/heartbeat";
      httpHb.begin(hbUrl);
      httpHb.addHeader("Content-Type", "application/json");
      httpHb.setTimeout(2500);

      String hbBody = "{\"mac\":\"" + WiFi.macAddress() + "\",\"token\":\"" + pairToken + "\"}";
      int hbCode = httpHb.POST(hbBody);

