izaanka/RhythmSleep_v3/esp32s3_rhythmSleep_arduinoide/esp32s3_rhythmSleep_arduinoide.ino
      if (hbCode == 200) {
        heartbeatFailCount = 0;
        String resp = httpHb.getString();
        int timeIdx = resp.indexOf("\"server_time\":");
        if (timeIdx != -1) {
          uint32_t sTime = (uint32_t)resp.substring(timeIdx + 14).toInt();
          if (sTime > 1700000000 && rtcAvailable) {
            rtc.adjust(DateTime(sTime));
          }
        }
      } else if (hbCode == 401) {
        Serial.println("[HEARTBEAT] Server rejected token / marked unpaired. Re-entering discovery mode...");
        isPaired = false;
        heartbeatFailCount = 0;
        preferences.begin("rhythm_cfg", false);
        preferences.putBool("is_paired", false);
        preferences.end();
      } else {
        heartbeatFailCount++;
        Serial.printf("[HEARTBEAT WARN] Server heartbeat missed (HTTP %d, Fail count: %d/3)\n", hbCode, heartbeatFailCount);
        
        // Also ping over serial
        Serial.printf("HEARTBEAT:%s:%s\n", WiFi.macAddress().c_str(), pairToken.c_str());

        // If 3 consecutive heartbeats fail (15 seconds of disconnection), drop to discovery for auto-reconnect
        if (heartbeatFailCount >= 3) {
          Serial.println("[HEARTBEAT FAILED] Server unreachable after 3 attempts. Auto-reconnecting via discovery...");
          isPaired = false;
          heartbeatFailCount = 0;
          preferences.begin("rhythm_cfg", false);
          preferences.putBool("is_paired", false);
          preferences.end();
        }
      }
      httpHb.end();
    }

    // 3. Telemetry Stream (every 5 seconds)
    if (isPaired && millis() - lastTelemetrySend >= 5000) {
      lastTelemetrySend = millis();

      HTTPClient http;
      String url = "http://" + serverIP + ":3000/api/sleep-data";
      http.begin(url);
      http.addHeader("Content-Type", "application/json");
      http.setTimeout(2500);

      DateTime now = getCurrentTime();

      String body = "{";
      body += "\"token\":\"" + pairToken + "\",";
      body += "\"mac\":\"" + WiFi.macAddress() + "\",";
      body += "\"dominant_freq\":" + String(currentDominantFreq, 2) + ",";
      body += "\"delta\":" + String(fabs(vReal[1]), 1) + ",";
      body += "\"theta\":" + String(fabs(vReal[5]), 1) + ",";
      body += "\"alpha\":" + String(fabs(vReal[10]), 1) + ",";
      body += "\"beta\":" + String(fabs(vReal[20]), 1) + ",";
      body += "\"gamma\":" + String(fabs(vReal[40]), 1) + ",";
      body += "\"stage\":\"" + String(nnStageNames[currentNNStage]) + "\",";
      body += "\"stage_code\":" + String(currentNNStage) + ",";
      body += "\"certainty\":" + String(currentNNConfidence * 100.0f, 1) + ",";
      body += "\"alarm_ringing\":" + String(alarmRinging ? "true" : "false") + ",";
      body += "\"session_completed\":" + String(sessionCompletedTrigger ? "true" : "false") + ",";
      body += "\"timestamp\":" + String(now.unixtime());
      body += "}";

      int httpCode = http.POST(body);
      if (httpCode > 0) {
        if (sessionCompletedTrigger) {
          sessionCompletedTrigger = false;
        }
        heartbeatFailCount = 0;
        String resp = http.getString();
        int timeIdx = resp.indexOf("\"server_time\":");
        if (timeIdx != -1) {
          uint32_t sTime = (uint32_t)resp.substring(timeIdx + 14).toInt();
          if (sTime > 1700000000 && rtcAvailable) {
            rtc.adjust(DateTime(sTime));
          }
        }
        if (resp.indexOf("unpaired") != -1 || httpCode == 401) {
          Serial.println("[TELEMETRY UNPAIRED] Server returned unpaired status. Clearing pairing...");
          isPaired = false;
          heartbeatFailCount = 0;
          preferences.begin("rhythm_cfg", false);
          preferences.putBool("is_paired", false);
          preferences.end();
        }
      } else {
        Serial.printf("[TELEMETRY FAIL] HTTP POST error: %s\n", http.errorToString(httpCode).c_str());
      }
      http.end();
    }
  }
}

void handleSerialCommands() {
  if (Serial.available() > 0) {
    String cmd = Serial.readStringUntil('\n');
    cmd.trim();
    if (cmd.length() == 0) return;

    Serial.printf("[SERIAL CMD] %s\n", cmd.c_str());

    if (cmd.startsWith("WIFI:")) {
      int firstColon = cmd.indexOf(':');
      int secondColon = cmd.indexOf(':', firstColon + 1);
      if (firstColon != -1) {
        String newSsid = (secondColon != -1) ? cmd.substring(firstColon + 1, secondColon) : cmd.substring(firstColon + 1);
        String newPass = (secondColon != -1) ? cmd.substring(secondColon + 1) : "";
        
        preferences.begin("rhythm_cfg", false);
        preferences.putString("ssid", newSsid);
        preferences.putString("pass", newPass);
        preferences.end();
        Serial.printf("[SERIAL WIFI] Saved SSID: %s. Connecting...\n", newSsid.c_str());
        initWiFiProvisioning();
      }
    } else if (cmd.startsWith("PAIR:")) {
      int firstColon = cmd.indexOf(':');
      int secondColon = cmd.indexOf(':', firstColon + 1);
      if (firstColon != -1) {
        serverIP = (secondColon != -1) ? cmd.substring(firstColon + 1, secondColon) : cmd.substring(firstColon + 1);
        pairToken = (secondColon != -1) ? cmd.substring(secondColon + 1) : "RS-PAIR-DIRECT";
        isPaired = true;
        heartbeatFailCount = 0;
        preferences.begin("rhythm_cfg", false);
        preferences.putString("server_ip", serverIP);
        preferences.putString("token", pairToken);
        preferences.putBool("is_paired", true);
        preferences.end();
        Serial.printf("[SERIAL PAIR SUCCESS] Server: %s | Token: %s\n", serverIP.c_str(), pairToken.c_str());
        fetchServerTime();
      }
    } else if (cmd.startsWith("HEARTBEAT_ACK:")) {
      int firstColon = cmd.indexOf(':');
      int secondColon = cmd.indexOf(':', firstColon + 1);
      if (firstColon != -1) {
        serverIP = (secondColon != -1) ? cmd.substring(firstColon + 1, secondColon) : cmd.substring(firstColon + 1);
        pairToken = (secondColon != -1) ? cmd.substring(secondColon + 1) : pairToken;
        isPaired = true;
        heartbeatFailCount = 0;
        Serial.println("[SERIAL HEARTBEAT ACK] Server confirmed connection via Serial.");
      }
    } else if (cmd == "UNPAIR") {
      isPaired = false;
      heartbeatFailCount = 0;
      preferences.begin("rhythm_cfg", false);
      preferences.putBool("is_paired", false);
      preferences.end();
      Serial.println("[SERIAL UNPAIR] Pairing cleared on ESP32.");
    } else if (cmd == "STATUS") {
      Serial.printf("[STATUS] WiFi: %s | IP: %s | MAC: %s | Paired: %s | Server: %s | AP: %s\n",
        (WiFi.status() == WL_CONNECTED) ? "CONNECTED" : "DISCONNECTED",
        WiFi.localIP().toString().c_str(),
        WiFi.macAddress().c_str(),
        isPaired ? "YES" : "NO",
        serverIP.c_str(),
        isAPMode ? "ACTIVE" : "OFF"
      );
    } else if (cmd == "RESET_WIFI" || cmd == "RESET") {
      performFactoryReset();
    }
  }
}

