izaanka/RhythmSleep_v3/esp32s3_rhythmSleep_arduinoide/esp32s3_rhythmSleep_arduinoide.ino
void renderMenuWiFiReset() {
  oledDisplay.setTextSize(1);
  oledDisplay.setCursor(0, 0);
  oledDisplay.print("[5/6] WIFI & RESET");
  oledDisplay.drawFastHLine(0, 11, 128, SSD1306_WHITE);

  oledDisplay.setCursor(0, 16);
  if (isAPMode) {
    oledDisplay.print("WiFi: AP (Setup)");
    oledDisplay.setCursor(0, 26);
    oledDisplay.print("IP: 192.168.4.1");
  } else if (WiFi.status() == WL_CONNECTED) {
    oledDisplay.print("WiFi: Connected");
    oledDisplay.setCursor(0, 26);
    oledDisplay.printf("IP: %s", WiFi.localIP().toString().c_str());
  } else {
    oledDisplay.print("WiFi: Disconnected");
  }

  oledDisplay.setCursor(0, 38);
  if (isPaired && serverIP.length() > 0) {
    oledDisplay.printf("Srv: %s:3000", serverIP.c_str());
  } else {
    oledDisplay.print("Server: SEARCHING...");
  }

  oledDisplay.drawFastHLine(0, 48, 128, SSD1306_WHITE);
  oledDisplay.setCursor(0, 53);
  oledDisplay.print("> PRESS SEL: RESET");
}

void renderMenuDeepSleep() {
  oledDisplay.setTextSize(1);
  oledDisplay.setCursor(0, 0);
  oledDisplay.print("[6/6] DEEP SLEEP");
  oledDisplay.drawFastHLine(0, 11, 128, SSD1306_WHITE);

  oledDisplay.setCursor(0, 18);
  oledDisplay.print("RTC Keeps Time");

  oledDisplay.setCursor(0, 30);
  oledDisplay.print("Wake: Any Button");

  oledDisplay.drawFastHLine(0, 43, 128, SSD1306_WHITE);
  oledDisplay.setCursor(0, 50);
  oledDisplay.print("> PRESS SEL: SLEEP");
}

void enterDeepSleep() {
  Serial.println("[POWER] Waiting for all buttons to be released before Deep Sleep...");

  // Wait for all 4 buttons to be released (HIGH)
  unsigned long waitStart = millis();
  while ((digitalRead(BTN_MENU_PIN) == LOW || digitalRead(BTN_UP_PIN) == LOW || 
          digitalRead(BTN_DOWN_PIN) == LOW || digitalRead(BTN_SELECT_PIN) == LOW) && (millis() - waitStart < 3000)) {
    delay(20);
  }
  delay(300); // 300ms debounce guard after release

  Serial.println("[POWER] Configuring RTC IO pullups for wake pins...");

  // Enable RTC pull-ups on wake pins so they stay pulled HIGH (not floating LOW) during deep sleep
  const gpio_num_t wakePins[] = { (gpio_num_t)BTN_UP_PIN, (gpio_num_t)BTN_SELECT_PIN, (gpio_num_t)BTN_DOWN_PIN, (gpio_num_t)BTN_MENU_PIN };
  for (int i = 0; i < 4; i++) {
    rtc_gpio_init(wakePins[i]);
    rtc_gpio_set_direction(wakePins[i], RTC_GPIO_MODE_INPUT_ONLY);
    rtc_gpio_pullup_en(wakePins[i]);
    rtc_gpio_pulldown_dis(wakePins[i]);
  }

  // Keep RTC Peripherals powered so internal pull-ups remain active during Deep Sleep
  esp_sleep_pd_config(ESP_PD_DOMAIN_RTC_PERIPH, ESP_PD_OPTION_ON);

  Serial.println("[POWER] Entering Deep Sleep. RTC clock remains active. Wake via any button press...");

  if (oledAvailable) {
    oledDisplay.clearDisplay();
    oledDisplay.display();
    delay(10);
    oledDisplay.ssd1306_command(SSD1306_DISPLAYOFF);
  }
  digitalWrite(TFT_BLK, LOW);

  digitalWrite(PIN_VIBRATION, LOW);
  playTone(0);
  digitalWrite(SD_VCC_PIN, LOW);

  WiFi.mode(WIFI_OFF);
  btStop();

  delay(100);

  uint64_t mask = (1ULL << BTN_UP_PIN) | (1ULL << BTN_SELECT_PIN) | (1ULL << BTN_DOWN_PIN) | (1ULL << BTN_MENU_PIN);
  esp_sleep_enable_ext1_wakeup(mask, ESP_EXT1_WAKEUP_ANY_LOW);
  esp_deep_sleep_start();
}

void renderTFTWiFiReset() {
  digitalWrite(SD_CS_PIN, HIGH);
  digitalWrite(TFT_CS, LOW);

  if (lastTFTSec == 255) {
    tftDisplay.setTextColor(ST7789_CYAN);
    tftDisplay.setTextSize(2);
    tftDisplay.setCursor(10, 10);
    tftDisplay.print("RhythmSleep [5/6] WIFI");
    tftDisplay.drawFastHLine(0, 35, 320, ST7789_DARKGRAY);
    lastTFTSec = 0;
  }

  tftDisplay.setTextSize(2);
  
  tftDisplay.setTextColor(ST7789_WHITE, ST7789_BLACK);
  tftDisplay.setCursor(10, 50);
  if (isAPMode) {
    tftDisplay.print("WiFi Mode : AP SoftAP    ");
    tftDisplay.setCursor(10, 75);
    tftDisplay.print("Config IP : 192.168.4.1  ");
  } else if (WiFi.status() == WL_CONNECTED) {
    tftDisplay.print("WiFi Mode : Connected    ");
    tftDisplay.setCursor(10, 75);
    tftDisplay.printf("Local IP  : %-14s", WiFi.localIP().toString().c_str());
  } else {
    tftDisplay.print("WiFi Mode : Disconnected ");
    tftDisplay.setCursor(10, 75);
    tftDisplay.print("Local IP  : ---.---.---.-");
  }

  tftDisplay.setCursor(10, 105);
  if (isPaired && serverIP.length() > 0) {
    tftDisplay.setTextColor(ST7789_CYAN, ST7789_BLACK);
    tftDisplay.printf("Server IP : %s:3000        ", serverIP.c_str());
  } else {
    tftDisplay.setTextColor(ST7789_YELLOW, ST7789_BLACK);
    tftDisplay.print("Server IP : SEARCHING...        ");
  }

  tftDisplay.fillRect(10, 140, 300, 38, ST7789_RED);
  tftDisplay.drawRect(10, 140, 300, 38, ST7789_WHITE);
  tftDisplay.setTextColor(ST7789_WHITE);
  tftDisplay.setTextSize(2);
  tftDisplay.setCursor(20, 150);
  tftDisplay.print("PRESS OK -> FACTORY RESET");

  digitalWrite(TFT_CS, HIGH);
}

void renderTFTDeepSleep() {
  digitalWrite(SD_CS_PIN, HIGH);
  digitalWrite(TFT_CS, LOW);

  if (lastTFTSec == 255) {
    tftDisplay.setTextColor(ST7789_CYAN);
    tftDisplay.setTextSize(2);
    tftDisplay.setCursor(10, 10);
    tftDisplay.print("RhythmSleep [6/6] SLEEP");
    tftDisplay.drawFastHLine(0, 35, 320, ST7789_DARKGRAY);
    lastTFTSec = 0;
  }

  tftDisplay.setTextSize(2);
  tftDisplay.setTextColor(ST7789_WHITE, ST7789_BLACK);
  tftDisplay.setCursor(10, 50);
  tftDisplay.print("Power Saver Mode         ");
  tftDisplay.setCursor(10, 75);
  tftDisplay.print("RTC Clock Keeps Time     ");
  tftDisplay.setCursor(10, 100);
  tftDisplay.print("Wakeup: Press Any Button ");

  tftDisplay.fillRect(10, 135, 300, 38, ST7789_BLUE);
  tftDisplay.drawRect(10, 135, 300, 38, ST7789_WHITE);
  tftDisplay.setTextColor(ST7789_WHITE);
  tftDisplay.setTextSize(2);
  tftDisplay.setCursor(25, 145);
  tftDisplay.print("PRESS OK -> ENTER SLEEP");

  digitalWrite(TFT_CS, HIGH);
}

// ===================================================================
// ST7789 2.8" TFT Display Rendering
// ===================================================================

void drawTFTTouchButtons() {
  digitalWrite(SD_CS_PIN, HIGH);
  digitalWrite(TFT_CS, LOW);

  tftDisplay.drawFastHLine(0, 188, 320, ST7789_DARKGRAY);

  // Button 1: MENU
  tftDisplay.fillRect(5, 192, 70, 42, ST7789_BLUE);
  tftDisplay.drawRect(5, 192, 70, 42, ST7789_WHITE);
  tftDisplay.setTextColor(ST7789_WHITE);
  tftDisplay.setTextSize(2);
  tftDisplay.setCursor(15, 204);
  tftDisplay.print("MENU");

  // Button 2: UP (+)
  tftDisplay.fillRect(82, 192, 70, 42, ST7789_DARKGRAY);
  tftDisplay.drawRect(82, 192, 70, 42, ST7789_WHITE);
  tftDisplay.setCursor(102, 204);
  tftDisplay.print("UP+");

  // Button 3: DOWN (-)
  tftDisplay.fillRect(160, 192, 70, 42, ST7789_DARKGRAY);
  tftDisplay.drawRect(160, 192, 70, 42, ST7789_WHITE);
  tftDisplay.setCursor(170, 204);
  tftDisplay.print("DN-");

  // Button 4: SELECT / OK
  tftDisplay.fillRect(238, 192, 77, 42, ST7789_BLUE);
  tftDisplay.drawRect(238, 192, 77, 42, ST7789_WHITE);
  tftDisplay.setCursor(244, 204);
  tftDisplay.print("SELECT");
  
