izaanka/RhythmSleep_v3/esp32s3_rhythmSleep_arduinoide/esp32s3_rhythmSleep_arduinoide.ino
  digitalWrite(TFT_CS, HIGH);
}

void renderTFTTime(const DateTime &now) {
  digitalWrite(SD_CS_PIN, HIGH);
  digitalWrite(TFT_CS, LOW);

  if (lastTFTSec == 255) {
    tftDisplay.setTextColor(ST7789_CYAN);
    tftDisplay.setTextSize(2);
    tftDisplay.setCursor(10, 10);
    tftDisplay.print("RhythmSleep [1/6] TIME");
    tftDisplay.drawFastHLine(0, 35, 320, ST7789_DARKGRAY);
  }

  char timeBuf[12];
  snprintf(timeBuf, sizeof(timeBuf), "%02d:%02d:%02d", now.hour(), now.minute(), now.second());
  tftDisplay.setTextColor(ST7789_WHITE, ST7789_BLACK);
  tftDisplay.setTextSize(4);
  tftDisplay.setCursor(60, 65);
  tftDisplay.print(timeBuf);

  if (now.second() != lastTFTSec) {
    lastTFTSec = now.second();

    tftDisplay.drawFastHLine(20, 120, 280, ST7789_DARKGRAY);

    char dateBuf[30];
    snprintf(dateBuf, sizeof(dateBuf), "%s, %02d %s %04d", 
             daysOfWeek[now.dayOfTheWeek()], now.day(), monthsOfYear[now.month()], now.year());
    tftDisplay.setTextColor(ST7789_YELLOW, ST7789_BLACK);
    tftDisplay.setTextSize(2);
    tftDisplay.setCursor(45, 140);
    tftDisplay.print(dateBuf);
  }

  digitalWrite(TFT_CS, HIGH);
}

void renderTFTEEG() {
  digitalWrite(SD_CS_PIN, HIGH);
  digitalWrite(TFT_CS, LOW);

  if (lastTFTSec == 255) {
    tftDisplay.setTextColor(ST7789_CYAN);
    tftDisplay.setTextSize(2);
    tftDisplay.setCursor(10, 10);
    tftDisplay.print("RhythmSleep [2/6] EEG AI");
    tftDisplay.drawFastHLine(0, 35, 320, ST7789_DARKGRAY);
    lastTFTSec = 0;
  }

  tftDisplay.setTextSize(2);
  tftDisplay.setTextColor(ST7789_WHITE, ST7789_BLACK);
  tftDisplay.setCursor(10, 45);
  tftDisplay.printf("Peak Freq : %6.2f Hz  ", currentDominantFreq);

  tftDisplay.setTextColor(ST7789_YELLOW, ST7789_BLACK);
  tftDisplay.setCursor(10, 70);
  tftDisplay.printf("Band      : %-18s", getEEGBand(currentDominantFreq));

  tftDisplay.setTextColor(ST7789_GREEN, ST7789_BLACK);
  tftDisplay.setCursor(10, 95);
  tftDisplay.printf("NN Stage  : %s (%2.0f%%)   ", nnStageNames[currentNNStage], currentNNConfidence * 100.0f);

  tftDisplay.setCursor(10, 120);
  if (sleepSessionActive) {
    if (currentNNStage == STAGE_WAKE) {
      tftDisplay.setTextColor(ST7789_YELLOW, ST7789_BLACK);
      tftDisplay.print("Mode      : PRE-SLEEP AWAIT   ");
    } else {
      tftDisplay.setTextColor(ST7789_GREEN, ST7789_BLACK);
      tftDisplay.print("Mode      : SLEEP IN PROGRESS ");
    }
  } else {
    tftDisplay.setTextColor(ST7789_ORANGE, ST7789_BLACK);
    tftDisplay.print("Mode      : IDLE (Press OK)   ");
  }

  tftDisplay.setTextColor(ST7789_LIGHTGRAY, ST7789_BLACK);
  tftDisplay.setTextSize(1);
  tftDisplay.setCursor(10, 155);
  tftDisplay.printf("AI Weights: v%d (On-Device Learned) | SEL: Toggle Sleep", nnLearningSessionsCount);

  digitalWrite(TFT_CS, HIGH);
}

void renderTFTNNStats() {
  digitalWrite(SD_CS_PIN, HIGH);
  digitalWrite(TFT_CS, LOW);

  if (lastTFTSec == 255) {
    tftDisplay.setTextColor(ST7789_CYAN);
    tftDisplay.setTextSize(2);
    tftDisplay.setCursor(10, 10);
    tftDisplay.print("RhythmSleep [3/6] AI STATS");
    tftDisplay.drawFastHLine(0, 35, 320, ST7789_DARKGRAY);
    lastTFTSec = 0;
  }

  int calcLearned = (nnLearningSessionsCount == 0) ? 15 : (nnLearningSessionsCount * 20);
  uint8_t pctLearned = (calcLearned > 100) ? 100 : (uint8_t)calcLearned;
  int calcOpt = pctLearned + 10;
  uint8_t pctOptimized = (calcOpt > 100) ? 100 : (uint8_t)calcOpt;

  tftDisplay.setTextSize(2);
  tftDisplay.setTextColor(ST7789_WHITE, ST7789_BLACK);
  tftDisplay.setCursor(10, 45);
  tftDisplay.printf("AI Learned  : %3d%% ", pctLearned);

  tftDisplay.setTextColor(ST7789_GREEN, ST7789_BLACK);
  tftDisplay.setCursor(10, 75);
  tftDisplay.printf("Optimized   : %3d%% ", pctOptimized);

  tftDisplay.setTextColor(ST7789_YELLOW, ST7789_BLACK);
  tftDisplay.setCursor(10, 105);
  tftDisplay.printf("NVS Learn   : %d Passes ", nnLearningSessionsCount);

  tftDisplay.setTextColor(ST7789_CYAN, ST7789_BLACK);
  tftDisplay.setCursor(10, 135);
  tftDisplay.print("Model Arch  : 16-32-16-4 MLP");

  tftDisplay.setTextColor(ST7789_LIGHTGRAY, ST7789_BLACK);
  tftDisplay.setTextSize(1);
  tftDisplay.setCursor(10, 175);
  tftDisplay.print("On-Device Backprop active | OK: Force Recalibrate");

  digitalWrite(TFT_CS, HIGH);
}

void renderTFTAlarm() {
  digitalWrite(SD_CS_PIN, HIGH);
  digitalWrite(TFT_CS, LOW);

  if (lastTFTSec == 255) {
    tftDisplay.setTextColor(ST7789_CYAN);
    tftDisplay.setTextSize(2);
    tftDisplay.setCursor(10, 10);
    tftDisplay.print("RhythmSleep [4/6] ALARM");
    tftDisplay.drawFastHLine(0, 35, 320, ST7789_DARKGRAY);
    lastTFTSec = 0;
  }

  tftDisplay.setTextSize(2);
  
  tftDisplay.setTextColor(ST7789_WHITE, ST7789_BLACK);
  tftDisplay.setCursor(10, 50);
  tftDisplay.print("Start Time: ");
  tftDisplay.setTextColor((alarmEditField == 1) ? ST7789_YELLOW : ST7789_WHITE, ST7789_BLACK);
  tftDisplay.printf("%02d", alarmCfg.startHour);
  tftDisplay.setTextColor(ST7789_WHITE, ST7789_BLACK);
  tftDisplay.print(":");
  tftDisplay.setTextColor((alarmEditField == 2) ? ST7789_YELLOW : ST7789_WHITE, ST7789_BLACK);
  tftDisplay.printf("%02d", alarmCfg.startMin);

  tftDisplay.setTextColor(ST7789_WHITE, ST7789_BLACK);
  tftDisplay.setCursor(10, 85);
  tftDisplay.print("End Time  : ");
  tftDisplay.setTextColor((alarmEditField == 3) ? ST7789_YELLOW : ST7789_WHITE, ST7789_BLACK);
  tftDisplay.printf("%02d", alarmCfg.endHour);
  tftDisplay.setTextColor(ST7789_WHITE, ST7789_BLACK);
  tftDisplay.print(":");
  tftDisplay.setTextColor((alarmEditField == 4) ? ST7789_YELLOW : ST7789_WHITE, ST7789_BLACK);
  tftDisplay.printf("%02d", alarmCfg.endMin);

  tftDisplay.setTextColor(ST7789_WHITE, ST7789_BLACK);
  tftDisplay.setCursor(10, 120);
  tftDisplay.print("State     : ");
  tftDisplay.setTextColor((alarmEditField == 5) ? ST7789_YELLOW : ST7789_WHITE, ST7789_BLACK);
  tftDisplay.print(alarmCfg.enabled ? "[ SMART ON ] " : "[ DISABLED ] ");

  tftDisplay.setTextColor(ST7789_LIGHTGRAY, ST7789_BLACK);
  tftDisplay.setTextSize(1);
  tftDisplay.setCursor(10, 155);
  tftDisplay.print("Press OK (SELECT) button to edit/turn off alarm");

