izaanka/RhythmSleep_v3/esp32s3_rhythmSleep_arduinoide/esp32s3_rhythmSleep_arduinoide.ino
  digitalWrite(TFT_CS, HIGH);
}

void renderTFTAlarmRinging(const DateTime &now) {
  static bool toggleColor = false;
  toggleColor = !toggleColor;

  digitalWrite(SD_CS_PIN, HIGH);
  digitalWrite(TFT_CS, LOW);

  tftDisplay.fillRect(0, 0, 320, 240, toggleColor ? ST7789_RED : ST7789_YELLOW);

  tftDisplay.setTextColor(toggleColor ? ST7789_WHITE : ST7789_BLACK);
  tftDisplay.setTextSize(3);
  tftDisplay.setCursor(20, 30);
  tftDisplay.print("SMART ALARM!");

  char timeBuf[12];
  snprintf(timeBuf, sizeof(timeBuf), "%02d:%02d:%02d", now.hour(), now.minute(), now.second());
  tftDisplay.setTextSize(4);
  tftDisplay.setCursor(60, 90);
  tftDisplay.print(timeBuf);

  tftDisplay.setTextSize(2);
  tftDisplay.setCursor(25, 160);
  tftDisplay.print("VIBRATING MOTOR...");
  tftDisplay.setCursor(15, 195);
  tftDisplay.print("Press OK Button to Stop");

  digitalWrite(TFT_CS, HIGH);
}

// ===================================================================
// Neural Network & Math Calculations
// ===================================================================

void relu(float* x, int n) {
  for (int i = 0; i < n; i++) {
    if (x[i] < 0.0f) x[i] = 0.0f;
  }
}

void softmax(float* x, int n) {
  float maxVal = x[0];
  for (int i = 1; i < n; i++) {
    if (x[i] > maxVal) maxVal = x[i];
  }
  float sumExp = 0.0f;
  for (int i = 0; i < n; i++) {
    x[i] = expf(x[i] - maxVal);
    sumExp += x[i];
  }
  for (int i = 0; i < n; i++) {
    x[i] /= sumExp;
  }
}

void matmulRAM(const float* input, const float* w, const float* b, float* output, int inSize, int outSize) {
  for (int j = 0; j < outSize; j++) {
    float sum = b[j];
    for (int i = 0; i < inSize; i++) {
      sum += input[i] * w[j * inSize + i];
    }
    output[j] = sum;
  }
}

void runNeuralNetworkInference(double *vR, double *vI, uint16_t samples) {
  double binWidth = SAMPLING_FREQ / (double)samples;

  float deltaP = 0, thetaP = 0, alphaP = 0, betaP = 0, gammaP = 0, eegBandTotal = 0;
  float highFreqEnergy = 0;

  for (uint16_t i = 1; i < samples / 2; i++) {
    float freq = i * binWidth;
    float magSq = (vR[i] * vR[i] + vI[i] * vI[i]);

    if (freq >= 0.5f && freq < 4.0f)        deltaP += magSq;
    else if (freq >= 4.0f && freq < 8.0f)   thetaP += magSq;
    else if (freq >= 8.0f && freq < 13.0f)  alphaP += magSq;
    else if (freq >= 13.0f && freq < 30.0f) betaP += magSq;
    else if (freq >= 30.0f && freq <= 45.0f) gammaP += magSq;
    else if (freq > 45.0f)                  highFreqEnergy += magSq;
  }

  eegBandTotal = deltaP + thetaP + alphaP + betaP + gammaP;
  if (eegBandTotal < 1e-6f) eegBandTotal = 1e-6f;

  float relDelta = deltaP / eegBandTotal;
  float relTheta = thetaP / eegBandTotal;
  float relAlpha = alphaP / eegBandTotal;
  float relBeta  = betaP  / eegBandTotal;
  float relGamma = gammaP / eegBandTotal;

  float muscleWakeFactor = highFreqEnergy / (eegBandTotal + highFreqEnergy + 1e-5f);

  float rawFeatures[NN_INPUT_SIZE];
  auto clamp01 = [](float v) -> float { return v < 0.0f ? 0.0f : (v > 1.0f ? 1.0f : v); };

  rawFeatures[0]  = clamp01(relDelta);
  rawFeatures[1]  = clamp01(relTheta);
  rawFeatures[2]  = clamp01(relAlpha);
  rawFeatures[3]  = clamp01(relBeta + (muscleWakeFactor * 0.5f));  
  rawFeatures[4]  = clamp01(relGamma + (muscleWakeFactor * 0.5f)); 

  rawFeatures[5]  = clamp01((deltaP / (thetaP + 1e-5f)) / 10.0f);
  rawFeatures[6]  = clamp01((thetaP / (alphaP + 1e-5f)) / 10.0f);
  rawFeatures[7]  = clamp01((thetaP / (betaP  + 1e-5f)) / 10.0f);
  rawFeatures[8]  = clamp01(((deltaP + thetaP) / (alphaP + betaP + 1e-5f)) / 10.0f);

  rawFeatures[9]  = clamp01((currentDominantFreq - 0.5f) / 44.5f);
  
  float entropy = -(relDelta*logf(relDelta+1e-5f) + relTheta*logf(relTheta+1e-5f) + 
                    relAlpha*logf(relAlpha+1e-5f) + relBeta*logf(relBeta+1e-5f) + 
                    relGamma*logf(relGamma+1e-5f));
  rawFeatures[10] = clamp01(entropy / 2.5f);

  rawFeatures[11] = clamp01(logf(eegBandTotal + highFreqEnergy + 1.0f) / logf(10001.0f));
  rawFeatures[12] = clamp01(relAlpha + relBeta + muscleWakeFactor);
  rawFeatures[13] = clamp01(relDelta + relTheta);
  rawFeatures[14] = clamp01(sqrtf((eegBandTotal + highFreqEnergy) / (samples / 2)) / 200.0f);
  rawFeatures[15] = clamp01(relBeta + relGamma + muscleWakeFactor);

  for (int k = 0; k < NN_INPUT_SIZE; k++) {
    featureHistory[historyIndex][k] = rawFeatures[k];
  }
  historyIndex = (historyIndex + 1) % HISTORY_LEN;
  if (historyCount < HISTORY_LEN) historyCount++;

  float smoothedFeatures[NN_INPUT_SIZE] = {0};
  for (int h = 0; h < historyCount; h++) {
    for (int k = 0; k < NN_INPUT_SIZE; k++) {
      smoothedFeatures[k] += featureHistory[h][k];
    }
  }
  for (int k = 0; k < NN_INPUT_SIZE; k++) {
    smoothedFeatures[k] /= (float)historyCount;
  }

  const float* w1 = &nnRAMWeights[0];               
  const float* b1 = &nnRAMWeights[512];             
  const float* w2 = &nnRAMWeights[544];             
  const float* b2 = &nnRAMWeights[1056];            
  const float* w3 = &nnRAMWeights[1072];            
  const float* b3 = &nnRAMWeights[1136];            

  float out1[NN_HIDDEN1_SIZE];
  float out2[NN_HIDDEN2_SIZE];

  matmulRAM(smoothedFeatures, w1, b1, out1, NN_INPUT_SIZE, NN_HIDDEN1_SIZE);
  relu(out1, NN_HIDDEN1_SIZE);

  matmulRAM(out1, w2, b2, out2, NN_HIDDEN1_SIZE, NN_HIDDEN2_SIZE);
  relu(out2, NN_HIDDEN2_SIZE);

  matmulRAM(out2, w3, b3, nnConfidences, NN_HIDDEN2_SIZE, NN_OUTPUT_SIZE);

  // Spectral prior logit scaling for rich dynamic confidence (70% - 99%)
  if (relBeta > 0.25f || relGamma > 0.15f || currentDominantFreq >= 13.0f || muscleWakeFactor > 0.2f) {
    nnConfidences[STAGE_WAKE] += 2.0f + (relBeta * 3.0f);
  }
  if (relTheta > 0.30f) {
    nnConfidences[STAGE_LIGHT] += 1.5f + (relTheta * 2.0f);
  }
  if (relDelta > 0.35f) {
    nnConfidences[STAGE_DEEP] += 2.2f + (relDelta * 3.0f);
  }
  if (relTheta > 0.25f && relAlpha > 0.15f) {
    nnConfidences[STAGE_REM] += 1.5f + (relAlpha * 1.5f);
  }

  softmax(nnConfidences, NN_OUTPUT_SIZE);

