izaanka/RhythmSleep_v3/esp32s3_rhythmSleep_arduinoide/esp32s3_rhythmSleep_arduinoide.ino
  int bestClass = 0;
  float maxConf = nnConfidences[0];
  for (int i = 1; i < NN_OUTPUT_SIZE; i++) {
    if (nnConfidences[i] > maxConf) {
      maxConf = nnConfidences[i];
      bestClass = i;
    }
  }

  currentNNStage = static_cast<SleepStage>(bestClass);
  currentNNConfidence = maxConf;
}

// ===================================================================
// Smart Alarm Evaluator
// ===================================================================

void updateSmartAlarm(const DateTime &now) {
  if (!sleepSessionActive) return;
  static unsigned long lastSecTick = 0;
  if (millis() - lastSecTick < 1000) return;
  lastSecTick = millis();

  float lightCertainty = (currentNNStage == STAGE_LIGHT || currentNNStage == STAGE_WAKE) ? currentNNConfidence : 0.0f;
  
  sleepStageHistory120[history120Index] = (uint8_t)currentNNStage;
  lightConfHistory120[history120Index]  = lightCertainty;
  
  history120Index = (history120Index + 1) % SMART_ALARM_WINDOW_SEC;
  if (history120Count < SMART_ALARM_WINDOW_SEC) history120Count++;

  if (!alarmCfg.enabled) return;

  uint16_t currentMin = now.hour() * 60 + now.minute();
  uint16_t startMin   = alarmCfg.startHour * 60 + alarmCfg.startMin;
  uint16_t endMin     = alarmCfg.endHour * 60 + alarmCfg.endMin;

  bool insideWindow = false;
  if (startMin <= endMin) {
    insideWindow = (currentMin >= startMin && currentMin <= endMin);
  } else {
    insideWindow = (currentMin >= startMin || currentMin <= endMin);
  }

  if (insideWindow && !alarmTriggeredToday && !alarmRinging) {
    if (history120Count >= SMART_ALARM_WINDOW_SEC) {
      uint16_t lightStageSecs = 0;
      float lightConfSum = 0.0f;

      for (int i = 0; i < SMART_ALARM_WINDOW_SEC; i++) {
        if (sleepStageHistory120[i] == STAGE_LIGHT || sleepStageHistory120[i] == STAGE_WAKE) {
          lightStageSecs++;
        }
        lightConfSum += lightConfHistory120[i];
      }

      float avgCertainty = lightConfSum / (float)SMART_ALARM_WINDOW_SEC;

      if (lightStageSecs >= 100 && avgCertainty > 0.50f) {
        alarmRinging = true;
        alarmTriggeredToday = true;
        wakeUpDisplay();
        playTone(523); // Play 523 Hz C5 alarm tone
        Serial.printf("[SMART ALARM] Triggered! 2-min Light Sleep Certainty: %.1f%%\n", avgCertainty * 100.0f);
      }
    }

    if (currentMin == endMin && !alarmTriggeredToday) {
      alarmRinging = true;
      alarmTriggeredToday = true;
      wakeUpDisplay();
      playTone(523);
      Serial.println("[SMART ALARM] End of window reached. Triggering hard wake-up alarm!");
    }
  }

  if (!insideWindow) {
    alarmTriggeredToday = false;
  }
}

// ===================================================================
// Single-Shot Physical Button Handling (4 Tactile Buttons)
// ===================================================================

bool isButtonPressed(Button &btn) {
  bool reading = digitalRead(btn.pin);
  bool trigger = false;

  if (reading != btn.previousReading) {
    btn.lastDebounceTime = millis();
    btn.previousReading = reading;
  }

  if ((millis() - btn.lastDebounceTime) > DEBOUNCE_DELAY) {
    if (reading == LOW && btn.currentState == HIGH) {
      btn.currentState = LOW;
      trigger = true;
    } 
    else if (reading == HIGH && btn.currentState == LOW) {
      btn.currentState = HIGH;
    }
  }

  return trigger;
}

void handleButtonActions() {
  bool btn1 = isButtonPressed(btnMenu);
  bool btn2 = isButtonPressed(btnUp);
  bool btn3 = isButtonPressed(btnDown);
  bool btn4 = isButtonPressed(BTNSelect); // OK / SELECT Button

  if (alarmRinging) {
    if (btn4) {
      alarmRinging = false;
      sessionCompletedTrigger = true;
      systemState = STATE_IDLE;
      sleepSessionActive = false;
      digitalWrite(PIN_VIBRATION, LOW);
      playTone(0); // Stop alarm sound
      lastTFTMenu = 255;
      Serial.println("[ALARM] Smart Alarm turned OFF by OK SELECT button. Sleep session completed!");
      runOnDeviceLearningPass();
    }
    return;
  }

  if (btn1 || btn2 || btn3 || btn4) {
    if (displaySleeping) {
      wakeUpDisplay();
      return;
    }
    lastActivityMs = millis();
  }

  if (btn1) {
    alarmEditField = 0;
    currentMenu = (currentMenu + 1) % 6; // 0: Time, 1: EEG AI, 2: AI Stats, 3: Smart Alarm, 4: WiFi & Reset, 5: Deep Sleep
    lastTFTMenu = 255;
  }

  if (currentMenu == 1) { // Menu 1: EEG Real-Time - Toggle Sleep Tracking & Run NN Learning
    if (btn4) {
      if (!sleepSessionActive) {
        systemState = STATE_SLEEPING;
        sleepSessionActive = true;
        autoSleepRelaxationCounter = 0;
        Serial.println("[SLEEP MODE] Started Sleep Tracking Session!");
      } else {
        systemState = STATE_IDLE;
        sleepSessionActive = false;
        sessionCompletedTrigger = true;
        runOnDeviceLearningPass();
        Serial.println("[SLEEP MODE] Stopped Sleep Session. Executing On-Device NN Weight Learning!");
      }
      lastTFTMenu = 255;
    }
  }

  if (currentMenu == 2) { // Menu 2: Neural AI Stats - Manual Recalibration Pass
    if (btn4) {
      Serial.println("[AI MANUAL RECAL] User triggered manual Backpropagation pass!");
      runOnDeviceLearningPass();
      lastTFTMenu = 255;
    }
  }

  if (currentMenu == 3) { // Menu 3: Smart Alarm Edits
    if (btn4) {
      alarmEditField = (alarmEditField + 1) % 6;
    }

    if (btn2) {
      switch (alarmEditField) {
        case 1: alarmCfg.startHour = (alarmCfg.startHour + 1) % 24; break;
        case 2: alarmCfg.startMin  = (alarmCfg.startMin + 5) % 60; break;
        case 3: alarmCfg.endHour   = (alarmCfg.endHour + 1) % 24; break;
        case 4: alarmCfg.endMin    = (alarmCfg.endMin + 5) % 60; break;
        case 5: alarmCfg.enabled   = !alarmCfg.enabled; break;
        default: alarmCfg.enabled  = true; break;
      }
    }

    if (btn3) {
      switch (alarmEditField) {
        case 1: alarmCfg.startHour = (alarmCfg.startHour == 0) ? 23 : alarmCfg.startHour - 1; break;
        case 2: alarmCfg.startMin  = (alarmCfg.startMin == 0) ? 55 : alarmCfg.startMin - 5; break;
        case 3: alarmCfg.endHour   = (alarmCfg.endHour == 0) ? 23 : alarmCfg.endHour - 1; break;
        case 4: alarmCfg.endMin    = (alarmCfg.endMin == 0) ? 55 : alarmCfg.endMin - 5; break;
        case 5: alarmCfg.enabled   = !alarmCfg.enabled; break;
        default: alarmCfg.enabled  = false; break;
      }
    }
  }

  if (currentMenu == 4) { // Menu 4: WiFi & Factory Reset
    if (btn4) {
      performFactoryReset();
    }
  }

  if (currentMenu == 5) { // Menu 5: Deep Sleep / Power Down
    if (btn4) {
      enterDeepSleep();
    }
  }
}

// ===================================================================
// Non-Blocking High-Precision Sampling & FFT
// ===================================================================

void applyHannWindow(double *vData, uint16_t samples) {
  for (uint16_t i = 0; i < samples; i++) {
    vData[i] *= 0.5 * (1.0 - cos(2.0 * M_PI * i / (samples - 1)));
  }
}

void computeFFT(double *vR, double *vI, uint16_t samples) {
  uint16_t j = 0;
  for (uint16_t i = 0; i < samples - 1; i++) {
    if (i < j) {
      double tempR = vR[i]; vR[i] = vR[j]; vR[j] = tempR;
      double tempI = vI[i]; vI[i] = vI[j]; vI[j] = tempI;
    }
    uint16_t k = samples >> 1;
    while (k <= j) {
      j -= k;
      k >>= 1;
    }
    j += k;
  }

  for (uint16_t len = 2; len <= samples; len <<= 1) {
    double ang = -2.0 * M_PI / len;
    double wlenR = cos(ang);
    double wlenI = sin(ang);
    for (uint16_t i = 0; i < samples; i += len) {
      double wR = 1.0;
      double wI = 0.0;
      for (uint16_t j = 0; j < len / 2; j++) {
        uint16_t u = i + j;
        uint16_t v = i + j + len / 2;
        double vrR = vR[v] * wR - vI[v] * wI;
        double vrI = vR[v] * wI + vI[v] * wR;

