izaanka/RhythmSleep_v3/esp32s3_rhythmSleep_arduinoide/esp32s3_rhythmSleep_arduinoide.ino
        vR[v] = vR[u] - vrR;
        vI[v] = vI[u] - vrI;
        vR[u] = vR[u] + vrR;
        vI[u] = vI[u] + vrI;

        double nextWR = wR * wlenR - wI * wlenI;
        double nextWI = wR * wlenI + wI * wlenR;
        wR = nextWR;
        wI = nextWI;
      }
    }
  }
}

double findDominantFrequency(double *vR, double *vI, uint16_t samples, double samplingFreq, double minF, double maxF) {
  double maxMag = 0.0;
  uint16_t peakBin = 0;
  double binWidth = samplingFreq / samples;

  uint16_t minBin = (uint16_t)ceil(minF / binWidth);
  uint16_t maxBin = (uint16_t)floor(maxF / binWidth);

  for (uint16_t i = minBin; i <= maxBin; i++) {
    double mag = sqrt(vR[i] * vR[i] + vI[i] * vI[i]);
    if (mag > maxMag) {
      maxMag = mag;
      peakBin = i;
    }
  }

  return (peakBin * binWidth);
}

void updateFFT() {
  if (micros() - lastSampleMicros >= samplingPeriodUs) {
    lastSampleMicros = micros();

    uint16_t rawVal = analogRead(ANALOG_EEG_PIN);
    if (rawVal < 30 || rawVal > 4065) {
      isArtifactEpoch = true;
      totalArtifactCount++;
    }

    double filteredVal = applyBandpassFilter((double)rawVal);
    vReal[sampleIndex] = filteredVal;
    vImag[sampleIndex] = 0.0;
    sampleIndex++;

    if (sampleIndex >= SAMPLES) {
      double sum = 0;
      for (uint16_t i = 0; i < SAMPLES; i++) sum += vReal[i];
      double mean = sum / SAMPLES;
      for (uint16_t i = 0; i < SAMPLES; i++) vReal[i] -= mean;

      applyHannWindow(vReal, SAMPLES);
      computeFFT(vReal, vImag, SAMPLES);
      currentDominantFreq = findDominantFrequency(vReal, vImag, SAMPLES, SAMPLING_FREQ, MIN_FREQ, MAX_FREQ);

      if (isArtifactEpoch) {
        isArtifactEpoch = false;
        Serial.println("[SIGNAL REJECTED] ADC Rail / Motion Artifact detected. Epoch skipped.");
      } else {
        runNeuralNetworkInference(vReal, vImag, SAMPLES);
        currentNNStage = applyTemporalMajorityFilter(currentNNStage);

        // Auto-Sleep Relaxation Detection (3 minutes sustained relaxation < 12Hz)
        if (!sleepSessionActive && currentDominantFreq >= 0.5f && currentDominantFreq < 12.0f) {
          autoSleepRelaxationCounter++;
          if (autoSleepRelaxationCounter >= 36) { // 36 * 5s = 180s
            systemState = STATE_SLEEPING;
            sleepSessionActive = true;
            autoSleepRelaxationCounter = 0;
            Serial.println("[AUTO SLEEP DETECTED] Sustained EEG relaxation detected! Sleep Tracking Session activated.");
          }
        } else if (!sleepSessionActive) {
          autoSleepRelaxationCounter = 0;
        }
      }

      sampleIndex = 0;
    }
  }
}

// ===================================================================
// Arduino Setup & Loop
// ===================================================================

void setup() {
  Serial.begin(115200);
  while (!Serial && millis() < 3000);

  Serial.println("\n--- ESP32-S3 System (ST7789 TFT + BLE Audio + SD Music + PCF8563) ---");

  loadNNWeights();

  pinMode(BTN_MENU_PIN, INPUT_PULLUP);
  pinMode(BTN_UP_PIN, INPUT_PULLUP);
  pinMode(BTN_DOWN_PIN, INPUT_PULLUP);
  pinMode(BTN_SELECT_PIN, INPUT_PULLUP);

  pinMode(PIN_VIBRATION, OUTPUT);
  digitalWrite(PIN_VIBRATION, LOW);

  pinMode(TFT_BLK, OUTPUT);
  digitalWrite(TFT_BLK, HIGH);

  analogReadResolution(12);
  analogSetAttenuation(ADC_11db);

  initAudioSpeaker();
  initBLE();

  Wire.begin(SDA_PIN, SCL_PIN);
  Wire.setClock(400000);

  checkSDCardDetection();

  digitalWrite(SD_CS_PIN, HIGH);
  digitalWrite(TFT_CS, LOW);
  tftDisplay.init(240, 320);
  tftDisplay.setRotation(3); // Rotated 180 degrees
  tftDisplay.fillScreen(ST7789_BLACK);
  tftAvailable = true;

  tftDisplay.setTextColor(ST7789_CYAN);
  tftDisplay.setTextSize(2);
  tftDisplay.setCursor(20, 40);
  tftDisplay.println("ESP32-S3 RhythmSleep AI");
  tftDisplay.drawFastHLine(20, 70, 280, ST7789_WHITE);
  tftDisplay.setTextColor(ST7789_WHITE);
  tftDisplay.setTextSize(1);
  tftDisplay.setCursor(20, 90);
  tftDisplay.printf("SD Card: %s (%d files)\n", sdAvailable ? "Detected" : "NOT FOUND", sdFileCount);
  tftDisplay.setCursor(20, 105);
  tftDisplay.println("BLE Server: RhythmSleep_AI");
  tftDisplay.setCursor(20, 120);
  tftDisplay.println("Audio Output: GPIO 20 LEDC");
  digitalWrite(TFT_CS, HIGH);

  if (oledDisplay.begin(SSD1306_SWITCHCAPVCC, OLED_I2C_ADDR)) {
    oledAvailable = true;
    oledDisplay.setRotation(2); // Rotated 180 degrees
    oledDisplay.clearDisplay();
    oledDisplay.setTextColor(SSD1306_WHITE);
    oledDisplay.setTextSize(1);
    oledDisplay.setCursor(5, 10);
    oledDisplay.println("RhythmSleep AI Model");
    oledDisplay.drawFastHLine(5, 24, 118, SSD1306_WHITE);
    oledDisplay.setCursor(5, 36);
    oledDisplay.printf("SD Files: %d\n", sdFileCount);
    oledDisplay.setCursor(5, 48);
    oledDisplay.println("BLE & TFT Active");
    oledDisplay.display();
  }

  delay(1500);

  if (rtc.begin()) {
    rtcAvailable = true;
    if (rtc.lostPower()) {
      rtc.adjust(DateTime(F(__DATE__), F(__TIME__)));
    }
  }

  // Initialize WiFi AP Provisioning / Connection
  initWiFiProvisioning();

  digitalWrite(SD_CS_PIN, HIGH);
  digitalWrite(TFT_CS, LOW);
  tftDisplay.fillScreen(ST7789_BLACK);
  digitalWrite(TFT_CS, HIGH);

  drawTFTTouchButtons();
  
  lastActivityMs = millis();
  lastSampleMicros = micros();
}

void loop() {
  handleSerialCommands();
  handleButtonActions();

  // Run WiFi captive portal web server (AP mode) or UDP pairing & HTTP telemetry (STA mode)
  handlePairingAndTelemetry();

  if (alarmRinging) {
    bool pulse = (millis() / 100) % 2;
    digitalWrite(PIN_VIBRATION, pulse ? HIGH : LOW);
  } else {
    digitalWrite(PIN_VIBRATION, LOW);
  }

  if (!displaySleeping && !alarmRinging && (millis() - lastActivityMs >= DISPLAY_TIMEOUT_MS)) {
    displaySleeping = true;
    digitalWrite(TFT_BLK, LOW);
    if (oledAvailable) {
      oledDisplay.clearDisplay();
      oledDisplay.display();
      delay(10);
      oledDisplay.ssd1306_command(SSD1306_DISPLAYOFF);
    }
    Serial.println("[POWER] 15-Second Inactivity Timeout: TFT & OLED Displays Powered Down.");
  }

  updateFFT();

  DateTime now = getCurrentTime();

