izaanka/RhythmSleep_v3/esp32s3_rhythmSleep_arduinoide/esp32s3_rhythmSleep_arduinoide.ino
  updateSmartAlarm(now);

  static unsigned long lastTFTRenderMs = 0;
  if (tftAvailable) {
    if (alarmRinging) {
      if (millis() - lastTFTRenderMs >= 400) {
        lastTFTRenderMs = millis();
        renderTFTAlarmRinging(now);
      }
    } 
    else if (!displaySleeping && (millis() - lastTFTRenderMs >= 100 || currentMenu != lastTFTMenu)) {
      lastTFTRenderMs = millis();

      if (currentMenu != lastTFTMenu) {
        digitalWrite(SD_CS_PIN, HIGH);
        digitalWrite(TFT_CS, LOW);
        tftDisplay.fillRect(0, 0, 320, 185, ST7789_BLACK);
        digitalWrite(TFT_CS, HIGH);
        drawTFTTouchButtons();
        lastTFTMenu = currentMenu;
        lastTFTSec = 255;
      }

      if (currentMenu == 0) renderTFTTime(now);
      else if (currentMenu == 1) renderTFTEEG();
      else if (currentMenu == 2) renderTFTNNStats();
      else if (currentMenu == 3) renderTFTAlarm();
      else if (currentMenu == 4) renderTFTWiFiReset();
      else if (currentMenu == 5) renderTFTDeepSleep();
    }
  }

  static unsigned long lastOLEDRenderMs = 0;
  if (oledAvailable && !displaySleeping && (millis() - lastOLEDRenderMs >= 200)) {
    lastOLEDRenderMs = millis();
    oledDisplay.clearDisplay();
    if (alarmRinging) {
      renderOLEDAlarmRinging(now);
    } else {
      if (currentMenu == 0) renderMenuTime(now);
      else if (currentMenu == 1) renderMenuEEG();
      else if (currentMenu == 2) renderMenuNNStats();
      else if (currentMenu == 3) renderMenuAlarm();
      else if (currentMenu == 4) renderMenuWiFiReset();
      else if (currentMenu == 5) renderMenuDeepSleep();
    }
    oledDisplay.display();
  }

  static unsigned long lastSerialPrint = 0;
  if (millis() - lastSerialPrint >= 1000) {
    lastSerialPrint = millis();
    Serial.printf("%02d:%02d:%02d; %.2f Hz; NN_State: %s (%.0f%%) | WiFi: %s | Server: %s%s\n", 
                  now.hour(), now.minute(), now.second(), 
                  currentDominantFreq, 
                  nnStageNames[currentNNStage], 
                  currentNNConfidence * 100.0f,
                  isAPMode ? "SoftAP (192.168.4.1)" : (WiFi.status() == WL_CONNECTED ? WiFi.localIP().toString().c_str() : "Disconnected"),
                  isPaired ? "PAIRED" : "SEARCHING",
                  alarmRinging ? " *** ALARM RINGING & VIBRATING ***" : "");
  }
}
